[
  {
    "num": "1",
    "text": "The world is all that is the case.",
    "children": [
      {
        "num": "1.1",
        "text": "The world is the totality of facts, not of things.",
        "children": [
          {
            "num": "1.1.1",
            "text": "The world is determined by the facts, and by their being _all_ the facts.",
            "children": []
          },
          {
            "num": "1.1.2",
            "text": "For the totality of facts determines what is the case, and also whatever is not the case.",
            "children": []
          },
          {
            "num": "1.1.3",
            "text": "The facts in logical space are the world.",
            "children": []
          }
        ]
      },
      {
        "num": "1.2",
        "text": "The world divides into facts.",
        "children": [
          {
            "num": "1.2.1",
            "text": "Each item can be the case or not the case while everything else remains the same.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "num": "2",
    "text": "What is the case—a fact—is the existence of states of affairs.",
    "children": [
      {
        "num": "2.0",
        "text": "",
        "children": [
          {
            "num": "2.0.1",
            "text": "A state of affairs (a state of things) is a combination of objects (things).",
            "children": [
              {
                "num": "2.0.1.1",
                "text": "It is essential to things that they should be possible constituents of states of affairs.",
                "children": []
              },
              {
                "num": "2.0.1.2",
                "text": "In logic nothing is accidental: if a thing _can_ occur in a state of affairs, the possibility of the state of affairs must be written into the thing itself.",
                "children": [
                  {
                    "num": "2.0.1.2.1 (1/4)",
                    "text": "It would seem to be a sort of accident, if it turned out that a situation would fit a thing that could already exist entirely on its own. If things can occur in states of affairs, this possibility must be in them from the beginning."
                  },
                  {
                    "num": "2.0.1.2.1 (2/4)",
                    "text": "(Nothing in the province of logic can be merely possible."
                  },
                  {
                    "num": "2.0.1.2.1 (3/4)",
                    "text": "Logic deals with every possibility and all possibilities are its facts.) Just as we are quite unable to imagine spatial objects outside space or temporal objects outside time, so too there is _no_ object that we can imagine excluded from the possibility of combining with others."
                  },
                  {
                    "num": "2.0.1.2.1 (4/4)",
                    "text": "If I can imagine objects combined in states of affairs, I cannot imagine them excluded from the possibility of such combinations.",
                    "children": []
                  },
                  {
                    "num": "2.0.1.2.2",
                    "text": "Things are independent in so far as they can occur in all _possible_ situations, but this form of independence is a form of connexion with states of affairs, a form of dependence. (It is impossible for words to appear in two different roles: by themselves, and in propositions.)",
                    "children": []
                  },
                  {
                    "num": "2.0.1.2.3",
                    "text": "If I know an object I also know all its possible occurrences in states of affairs. (Every one of these possibilities must be part of the nature of the object.) A new possibility cannot be discovered later.",
                    "children": [
                      {
                        "num": "2.0.1.2.3.1",
                        "text": "If I am to know an object, though I need not know its external properties, I must know all its internal properties.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "num": "2.0.1.2.4",
                    "text": "If all objects are given, then at the same time all _possible_ states of affairs are also given.",
                    "children": []
                  }
                ]
              },
              {
                "num": "2.0.1.3",
                "text": "Each thing is, as it were, in a space of possible states of affairs. This space I can imagine empty, but I cannot imagine the thing without the space.",
                "children": [
                  {
                    "num": "2.0.1.3.1 (1/2)",
                    "text": "A spatial object must be situated in infinite space. (A spatial point is an argument-place.)  A speck in the visual field, thought it need not be red, must have some colour: it is, so to speak, surrounded by colour-space."
                  },
                  {
                    "num": "2.0.1.3.1 (2/2)",
                    "text": "Notes must have _some_ pitch, objects of the sense of touch _some_ degree of hardness, and so on.",
                    "children": []
                  }
                ]
              },
              {
                "num": "2.0.1.4",
                "text": "Objects contain the possibility of all situations.",
                "children": [
                  {
                    "num": "2.0.1.4.1",
                    "text": "The possibility of its occurring in states of affairs is the form of an object.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "2.0.2",
            "text": "Objects are simple.",
            "children": [
              {
                "num": "2.0.2.0",
                "text": "",
                "children": [
                  {
                    "num": "2.0.2.0.1",
                    "text": "Every statement about complexes can be resolved into a statement about their constituents and into the propositions that describe the complexes completely.",
                    "children": []
                  }
                ]
              },
              {
                "num": "2.0.2.1",
                "text": "Objects make up the substance of the world. That is why they cannot be composite.",
                "children": [
                  {
                    "num": "2.0.2.1.1",
                    "text": "If the world had no substance, then whether a proposition had sense would depend on whether another proposition was true.",
                    "children": []
                  },
                  {
                    "num": "2.0.2.1.2",
                    "text": "In that case we could not sketch any picture of the world (true or false).",
                    "children": []
                  }
                ]
              },
              {
                "num": "2.0.2.2",
                "text": "It is obvious that an imagined world, however different it may be from the real one, must have _something_—a form—in common with it.",
                "children": []
              },
              {
                "num": "2.0.2.3",
                "text": "Objects are just what constitute this unalterable form.",
                "children": [
                  {
                    "num": "2.0.2.3.1",
                    "text": "The substance of the world _can_ only determine a form, and not any material properties. For it is only by means of propositions that material properties are represented—only by the configuration of objects that they are produced.",
                    "children": []
                  },
                  {
                    "num": "2.0.2.3.2",
                    "text": "In a manner of speaking, objects are colourless.",
                    "children": []
                  },
                  {
                    "num": "2.0.2.3.3",
                    "text": "If two objects have the same logical form, the only distinction between them, apart from their external properties, is that they are different.",
                    "children": [
                      {
                        "num": "2.0.2.3.3.1 (1/3)",
                        "text": "Either a thing has properties that nothing else has, in which case we can immediately use a description to distinguish it from the others and refer to it;"
                      },
                      {
                        "num": "2.0.2.3.3.1 (2/3)",
                        "text": "or, on the other hand, there are several things that have the whole set of their properties in common, in which case it is quite impossible to indicate one of them."
                      },
                      {
                        "num": "2.0.2.3.3.1 (3/3)",
                        "text": "For if there is nothing to distinguish a thing, I cannot distinguish it, since otherwise it would be distinguished after all.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "num": "2.0.2.4",
                "text": "The substance is what subsists independently of what is the case.",
                "children": []
              },
              {
                "num": "2.0.2.5",
                "text": "It is form and content.",
                "children": [
                  {
                    "num": "2.0.2.5.1",
                    "text": "Space, time, colour (being coloured) are forms of objects.",
                    "children": []
                  }
                ]
              },
              {
                "num": "2.0.2.6",
                "text": "There must be objects, if the world is to have unalterable form.",
                "children": []
              },
              {
                "num": "2.0.2.7",
                "text": "Objects, the unalterable, and the subsistent are one and the same.",
                "children": [
                  {
                    "num": "2.0.2.7.1",
                    "text": "Objects are what is unalterable and subsistent; their configuration is what is changing and unstable.",
                    "children": []
                  },
                  {
                    "num": "2.0.2.7.2",
                    "text": "The configuration of objects produces states of affairs.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "2.0.3",
            "text": "In a state of affairs objects fit into one another like the links of a chain.",
            "children": [
              {
                "num": "2.0.3.1",
                "text": "In a state of affairs objects stand in a determinate relation to one another.",
                "children": []
              },
              {
                "num": "2.0.3.2",
                "text": "The determinate way in which objects are connected in a state of affairs is the structure of the state of affairs.",
                "children": []
              },
              {
                "num": "2.0.3.3",
                "text": "Form is the possibility of structure.",
                "children": []
              },
              {
                "num": "2.0.3.4",
                "text": "The structure of a fact consists of the structures of states of affairs.",
                "children": []
              }
            ]
          },
          {
            "num": "2.0.4",
            "text": "The totality of existing states of affairs is the world.",
            "children": []
          },
          {
            "num": "2.0.5",
            "text": "The totality of existing states of affairs also determines which states of affairs do not exist.",
            "children": []
          },
          {
            "num": "2.0.6",
            "text": "The existence and non-existence of states of affairs is reality. (We call the existence of states of affairs a positive fact, and their non-existence a negative fact.)",
            "children": [
              {
                "num": "2.0.6.1",
                "text": "States of affairs are independent of one another.",
                "children": []
              },
              {
                "num": "2.0.6.2",
                "text": "From the existence or non-existence of one state of affairs it is impossible to infer the existence or non-existence of another.",
                "children": []
              },
              {
                "num": "2.0.6.3",
                "text": "The sum-total of reality is the world.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "2.1",
        "text": "We picture facts to ourselves.",
        "children": [
          {
            "num": "2.1.1",
            "text": "A picture presents a situation in logical space, the existence and non-existence of states of affairs.",
            "children": []
          },
          {
            "num": "2.1.2",
            "text": "A picture is a model of reality.",
            "children": []
          },
          {
            "num": "2.1.3",
            "text": "In a picture objects have the elements of the picture corresponding to them.",
            "children": [
              {
                "num": "2.1.3.1",
                "text": "In a picture the elements of the picture are the representatives of objects.",
                "children": []
              }
            ]
          },
          {
            "num": "2.1.4",
            "text": "What constitutes a picture is that its elements are related to one another in a determinate way.",
            "children": [
              {
                "num": "2.1.4.1",
                "text": "A picture is a fact.",
                "children": []
              }
            ]
          },
          {
            "num": "2.1.5 (1/2)",
            "text": "The fact that the elements of a picture are related to one another in a determinate way represents that things are related to one another in the same way."
          },
          {
            "num": "2.1.5 (2/2)",
            "text": "Let us call this connexion of its elements the structure of the picture, and let us call the possibility of this structure the pictorial form of the picture.",
            "children": [
              {
                "num": "2.1.5.1",
                "text": "Pictorial form is the possibility that things are related to one another in the same way as the elements of the picture.",
                "children": [
                  {
                    "num": "2.1.5.1.1",
                    "text": "_That_ is how a picture is attached to reality; it reaches right out to it.",
                    "children": []
                  },
                  {
                    "num": "2.1.5.1.2",
                    "text": "It is laid against reality like a measure.",
                    "children": [
                      {
                        "num": "2.1.5.1.2.1",
                        "text": "Only the end-points of the graduating lines actually _touch_ the object that is to be measured.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "num": "2.1.5.1.3",
                    "text": "So a picture, conceived in this way, also includes the pictorial relationship, which makes it into a picture.",
                    "children": []
                  },
                  {
                    "num": "2.1.5.1.4",
                    "text": "The pictorial relationship consists of the correlations of the picture’s elements with things.",
                    "children": []
                  },
                  {
                    "num": "2.1.5.1.5",
                    "text": "These correlations are, as it were, the feelers of the picture’s elements, with which the picture touches reality.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "2.1.6",
            "text": "If a fact is to be a picture, it must have something in common with what it depicts.",
            "children": [
              {
                "num": "2.1.6.1",
                "text": "There must be something identical in a picture and what it depicts, to enable the one to be a picture of the other at all.",
                "children": []
              }
            ]
          },
          {
            "num": "2.1.7",
            "text": "What a picture must have in common with reality, in order to be able to depict it—correctly or incorrectly—in the way that it does, is its pictorial form.",
            "children": [
              {
                "num": "2.1.7.1",
                "text": "A picture can depict any reality whose form it has. A spatial picture can depict anything spatial, a coloured one anything coloured, etc.",
                "children": []
              },
              {
                "num": "2.1.7.2",
                "text": "A picture cannot, however, depict its pictorial form: it displays it.",
                "children": []
              },
              {
                "num": "2.1.7.3",
                "text": "A picture represents its subject from a position outside it. (Its standpoint is its representational form.) That is why a picture represents its subject correctly or incorrectly.",
                "children": []
              },
              {
                "num": "2.1.7.4",
                "text": "A picture cannot, however, place itself outside its representational form.",
                "children": []
              }
            ]
          },
          {
            "num": "2.1.8",
            "text": "What any picture, of whatever form, must have in common with reality, in order to be able to depict it—correctly or incorrectly—in any way at all, is logical form, i.e. the form of reality.",
            "children": [
              {
                "num": "2.1.8.1",
                "text": "A picture whose pictorial form is logical form is called a logical picture.",
                "children": []
              },
              {
                "num": "2.1.8.2",
                "text": "Every picture is _at the same time_ a logical one. (On the other hand, not every picture is, for example, a spatial one.)",
                "children": []
              }
            ]
          },
          {
            "num": "2.1.9",
            "text": "Logical pictures can depict the world.",
            "children": []
          }
        ]
      },
      {
        "num": "2.2",
        "text": "A picture has logico-pictorial form in common with what it depicts.",
        "children": [
          {
            "num": "2.2.0",
            "text": "",
            "children": [
              {
                "num": "2.2.0.1",
                "text": "A picture depicts reality by representing a possibility of existence and non-existence of states of affairs.",
                "children": []
              },
              {
                "num": "2.2.0.2",
                "text": "A picture represents a possible situation in logical  space.",
                "children": []
              },
              {
                "num": "2.2.0.3",
                "text": "A picture contains the possibility of the situation that it represents.",
                "children": []
              }
            ]
          },
          {
            "num": "2.2.1",
            "text": "A picture agrees with reality or fails to agree; it is correct or incorrect, true or false.",
            "children": []
          },
          {
            "num": "2.2.2",
            "text": "What a picture represents it represents independently of its truth or falsity, by means of its pictorial form.",
            "children": [
              {
                "num": "2.2.2.1",
                "text": "What a picture represents is its sense.",
                "children": []
              },
              {
                "num": "2.2.2.2",
                "text": "The agreement or disagreement of its sense with reality constitutes its truth or falsity.",
                "children": []
              },
              {
                "num": "2.2.2.3",
                "text": "In order to tell whether a picture is true or false we must compare it with reality.",
                "children": []
              },
              {
                "num": "2.2.2.4",
                "text": "It is impossible to tell from the picture alone whether it is true or false.",
                "children": []
              },
              {
                "num": "2.2.2.5",
                "text": "There are no pictures that are true _a priori_.",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "num": "3",
    "text": "A logical picture of facts is a thought.",
    "children": [
      {
        "num": "3.0",
        "text": "",
        "children": [
          {
            "num": "3.0.0",
            "text": "",
            "children": [
              {
                "num": "3.0.0.1",
                "text": "‘A state of affairs is thinkable’: what this means is that we can picture it to ourselves.",
                "children": []
              }
            ]
          },
          {
            "num": "3.0.1",
            "text": "The totality of true thoughts is a picture of the world.",
            "children": []
          },
          {
            "num": "3.0.2",
            "text": "A thought contains the possibility of the situation of which it is the thought. What is thinkable is possible too.",
            "children": []
          },
          {
            "num": "3.0.3",
            "text": "Thought can never be of anything illogical, since, if it were, we should have to think illogically.",
            "children": [
              {
                "num": "3.0.3.1",
                "text": "It used to be said that God could create anything except what would be contrary to the laws of logic. The truth is that we could not _say_ what an ‘illogical’ world would look like.",
                "children": []
              },
              {
                "num": "3.0.3.2",
                "text": "It is as impossible to represent in language anything that ‘contradicts logic’ as it is in geometry to represent by its co-ordinates a figure that contradicts the laws of space, or to give the co-ordinates of a point that does not exist.",
                "children": [
                  {
                    "num": "3.0.3.2.1",
                    "text": "Though a state of affairs that would contravene the laws of physics can be represented by us spatially, one that would contravene the laws of geometry cannot.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "3.0.4",
            "text": "If a thought were correct _a priori_, it would be a thought whose possibility ensured its truth.",
            "children": []
          },
          {
            "num": "3.0.5",
            "text": "_A priori_ knowledge that a thought was true would be possible only if its truth were recognizable from the thought itself (without anything to compare it with).",
            "children": []
          }
        ]
      },
      {
        "num": "3.1",
        "text": "In a proposition a thought finds an expression that can be perceived by the senses.",
        "children": [
          {
            "num": "3.1.1",
            "text": "We use the perceptible sign of a proposition (spoken or written, etc.) as a projection of a possible situation. The method of projection is to think of the sense of the proposition.",
            "children": []
          },
          {
            "num": "3.1.2",
            "text": "I call the sign with which we express a thought a propositional sign.—And a proposition is a propositional sign in its projective relation to the world.",
            "children": []
          },
          {
            "num": "3.1.3 (1/2)",
            "text": "A proposition includes all that the projection includes, but not what is projected. Therefore, though what is projected is not itself included, its possibility is. A proposition, therefore, does not actually contain its sense, but does contain the possibility of expressing it."
          },
          {
            "num": "3.1.3 (2/2)",
            "text": "(‘The content of a proposition’ means the content of a proposition that has sense.)  A proposition contains the form, but not the content, of its sense.",
            "children": []
          },
          {
            "num": "3.1.4",
            "text": "What constitutes a propositional sign is that in it its elements (the words) stand in a determinate relation to one another. A propositional sign is a fact.",
            "children": [
              {
                "num": "3.1.4.1",
                "text": "A proposition is not a blend of words.—(Just as a theme in music is not a blend of notes.) A proposition is articulate.",
                "children": []
              },
              {
                "num": "3.1.4.2",
                "text": "Only facts can express a sense, a set of names cannot.",
                "children": []
              },
              {
                "num": "3.1.4.3 (1/2)",
                "text": "Although a propositional sign is a fact, this is obscured by the usual form of expression in writing or print. For in a printed proposition, for example, no essential difference is apparent between a propositional sign and a word."
              },
              {
                "num": "3.1.4.3 (2/2)",
                "text": "(That is what made it possible for Frege to call a proposition a composite name.)",
                "children": [
                  {
                    "num": "3.1.4.3.1",
                    "text": "The essence of a propositional sign is very clearly seen if we imagine one composed of spatial objects (such as tables, chairs, and books) instead of written signs. Then the spatial arrangement of these things will express the sense of the proposition.",
                    "children": []
                  },
                  {
                    "num": "3.1.4.3.2",
                    "text": "Instead of, ‘The complex sign “aRb” says that a stands to b in the relation R’, we ought to put, ‘_That_ “a” stands to “b” in a certain relation says _that_ aRb.’",
                    "children": []
                  }
                ]
              },
              {
                "num": "3.1.4.4",
                "text": "Situations can be described but not _given names_. (Names are like points; propositions like arrows—they have sense.)",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "3.2",
        "text": "In a proposition a thought can be expressed in such a way that elements of the propositional sign correspond to the objects of the thought.",
        "children": [
          {
            "num": "3.2.0",
            "text": "",
            "children": [
              {
                "num": "3.2.0.1",
                "text": "I call such elements ‘simple signs’, and such a proposition ‘complete analysed’.",
                "children": []
              },
              {
                "num": "3.2.0.2",
                "text": "The simple signs employed in propositions are called names.",
                "children": []
              },
              {
                "num": "3.2.0.3",
                "text": "A name means an object. The object is its meaning. (‘A’ is the same sign as ‘A’.)",
                "children": []
              }
            ]
          },
          {
            "num": "3.2.1",
            "text": "The configuration of objects in a situation corresponds to the configuration of simple signs in the propositional sign.",
            "children": []
          },
          {
            "num": "3.2.2",
            "text": "In a proposition a name is the representative of an object.",
            "children": [
              {
                "num": "3.2.2.1",
                "text": "Objects can only be _named_. Signs are their representatives. I can only speak _about_ them: I cannot _put them into words_. Propositions can only say _how_ things are, not _what_ they are.",
                "children": []
              }
            ]
          },
          {
            "num": "3.2.3",
            "text": "The requirement that simple signs be possible is the requirement that sense be determinate.",
            "children": []
          },
          {
            "num": "3.2.4 (1/3)",
            "text": "A proposition about a complex stands in an internal relation to a proposition about a constituent of the complex. A complex can be given only by its description, which will be right or wrong."
          },
          {
            "num": "3.2.4 (2/3)",
            "text": "A proposition that mentions a complex will not be nonsensical, if the complex does not exist, but simply false. When a propositional element signifies a complex, this can be seen from an indeterminateness in the propositions in which it occurs."
          },
          {
            "num": "3.2.4 (3/3)",
            "text": "In such cases we _know_ that the proposition leaves something undetermined. (In fact the notation for generality _contains_ a prototype.) The contraction of a symbol for a complex into a simple symbol can be expressed in a definition.",
            "children": []
          },
          {
            "num": "3.2.5",
            "text": "A proposition has one and only one complete analysis.",
            "children": [
              {
                "num": "3.2.5.1",
                "text": "What a proposition expresses it expresses in a determinate manner, which can be set out clearly: a proposition is articulated.",
                "children": []
              }
            ]
          },
          {
            "num": "3.2.6",
            "text": "A name cannot be dissected any further by means of a definition: it is a primitive sign.",
            "children": [
              {
                "num": "3.2.6.1 (1/2)",
                "text": "Every sign that has a definition signifies _via_ the signs that serve to define it; and the definitions point the way. Two signs cannot signify in the same manner if one is primitive and the other is defined by means of primitive signs."
              },
              {
                "num": "3.2.6.1 (2/2)",
                "text": "Names _cannot_ be anatomized by means of definitions. (Nor can any sign that has a meaning independently and on its own.)",
                "children": []
              },
              {
                "num": "3.2.6.2",
                "text": "What signs fail to express, their application shows. What signs slur over, their application says clearly.",
                "children": []
              },
              {
                "num": "3.2.6.3",
                "text": "The meanings of primitive signs can be explained by means of elucidations. Elucidations are propositions that contain the primitive signs. So they can only be understood if the meanings of those signs are already known.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "3.3",
        "text": "Only propositions have sense; only in the nexus of a proposition does a name have meaning.",
        "children": [
          {
            "num": "3.3.1",
            "text": "I call any part of a proposition that characterizes its sense an expression (or a symbol). (A proposition is itself an expression.) Everything essential to their sense that propositions can have in common with one another is an expression. An expression is the mark of a form and a content.",
            "children": [
              {
                "num": "3.3.1.1",
                "text": "An expression presupposes the forms of all the propositions in which it can occur. It is the common characteristic mark of a class of propositions.",
                "children": []
              },
              {
                "num": "3.3.1.2",
                "text": "It is therefore presented by means of the general form of the propositions that it characterizes. In fact, in this form the expression will be _constant_ and everything else _variable_.",
                "children": []
              },
              {
                "num": "3.3.1.3",
                "text": "Thus an expression is presented by means of a variable whose values are the propositions that contain the expression. (In the limiting case the variable becomes a constant, the expression becomes a proposition.) I call such a variable a ‘propositional variable’.",
                "children": []
              },
              {
                "num": "3.3.1.4",
                "text": "An expression has meaning only in a proposition. All variables can be construed as propositional variables. (Even variable names.)",
                "children": []
              },
              {
                "num": "3.3.1.5 (1/3)",
                "text": "If we turn a constituent of a proposition into a variable, there is a class of propositions all of which are values of the resulting variable proposition."
              },
              {
                "num": "3.3.1.5 (2/3)",
                "text": "In general, this class too will be dependent on the meaning that our arbitrary conventions have given to parts of the original proposition. But if all the signs in it that have arbitrarily determined meanings are turned into variables, we shall still get a class of this kind."
              },
              {
                "num": "3.3.1.5 (3/3)",
                "text": "This one, however, is not dependent on any convention, but solely on the nature of the proposition. It corresponds to a logical form—a logical prototype.",
                "children": []
              },
              {
                "num": "3.3.1.6",
                "text": "What values a propositional variable may take is something that is stipulated. The stipulation of values _is_ the variable.",
                "children": []
              },
              {
                "num": "3.3.1.7 (1/2)",
                "text": "To stipulate values for a propositional variable is to _give the propositions_ whose common characteristic the variable is. The stipulation is a description of those propositions. The stipulation will therefore be concerned only with symbols, not with their meaning."
              },
              {
                "num": "3.3.1.7 (2/2)",
                "text": "And the _only_ thing essential to the stipulation is _that it is merely a description of symbols and states nothing about what is signified_. How the description of the propositions is produced is not essential.",
                "children": []
              },
              {
                "num": "3.3.1.8",
                "text": "Like Frege and Russell I construe a proposition as a function of the expressions contained in it.",
                "children": []
              }
            ]
          },
          {
            "num": "3.3.2",
            "text": "A sign is what can be perceived of a symbol.",
            "children": [
              {
                "num": "3.3.2.1",
                "text": "So one and the same sign (written or spoken, etc.) can be common to two different symbols—in which case they will signify in different ways.",
                "children": []
              },
              {
                "num": "3.3.2.2 (1/2)",
                "text": "Our use of the same sign to signify two different objects can never indicate a common characteristic of the two, if we use it with two different _modes of signification_. For the sign, of course, is arbitrary."
              },
              {
                "num": "3.3.2.2 (2/2)",
                "text": "So we could choose two different signs instead, and then what would be left in common on the signifying side?",
                "children": []
              },
              {
                "num": "3.3.2.3 (1/3)",
                "text": "In everyday language it very frequently happens that the same word has different modes of signification—and so belongs to different symbols—or that two words that have different modes of signification are employed in propositions in what is superficially the same way."
              },
              {
                "num": "3.3.2.3 (2/3)",
                "text": "Thus the word ‘is’ figures as the copula, as a sign for identity, and as an expression for existence; ‘exist’ figures as an intransitive verb like ‘go’, and ‘identical’ as an adjective; we speak of _something_, but also of _something’s_ happening."
              },
              {
                "num": "3.3.2.3 (3/3)",
                "text": "(In the proposition, ‘Green is green’—where the first word is the proper name of a person and the last an adjective—these words do not merely have different meanings: they are _different symbols_.)",
                "children": []
              },
              {
                "num": "3.3.2.4",
                "text": "In this way the most fundamental confusions are easily produced (the whole of philosophy is full of them).",
                "children": []
              },
              {
                "num": "3.3.2.5 (1/2)",
                "text": "In order to avoid such errors we must make use of a sign-language that excludes them by not using the same sign for different symbols and by not using in a superficially similar way signs that have different modes of signification:"
              },
              {
                "num": "3.3.2.5 (2/2)",
                "text": "that is to say, a sign-language that is governed by _logical_ grammar—by logical syntax. (The conceptual notation of Frege and Russell is such a language, though, it is true, it fails to exclude all mistakes.)",
                "children": []
              },
              {
                "num": "3.3.2.6",
                "text": "In order to recognize a symbol by its sign we must observe how it is used with a sense.",
                "children": []
              },
              {
                "num": "3.3.2.7",
                "text": "A sign does not determine a logical form unless it is taken together with its logico-syntactical employment.",
                "children": []
              },
              {
                "num": "3.3.2.8",
                "text": "If a sign is _useless_, it is meaningless. That is the point of Occam’s maxim. (If everything behaves as if a sign had meaning, then it does have meaning.)",
                "children": []
              }
            ]
          },
          {
            "num": "3.3.3",
            "text": "In logical syntax the meaning of a sign should never play a role. It must be possible to establish logical syntax without mentioning the _meaning_ of a sign: _only_ the description of expressions may be presupposed.",
            "children": [
              {
                "num": "3.3.3.1",
                "text": "From this observation we turn to Russell’s ‘theory of types’. It can be seen that Russell must be wrong, because he had to mention the meaning of signs when establishing the rules for them.",
                "children": []
              },
              {
                "num": "3.3.3.2",
                "text": "No proposition can make a statement about itself, because a propositional sign cannot be contained in itself (that is the whole of the ‘theory of types’).",
                "children": []
              },
              {
                "num": "3.3.3.3 (1/4)",
                "text": "The reason why a function cannot be its own argument is that the sign for a function already contains the prototype of its argument, and it cannot contain itself."
              },
              {
                "num": "3.3.3.3 (2/4)",
                "text": "For let us suppose that the function F(fx) could be its own argument:"
              },
              {
                "num": "3.3.3.3 (3/4)",
                "text": "in that case there would be a proposition ‘F(F(fx))’, in which the outer function F and the inner function F must have different meanings, since the inner one has the form ϕ(fx) and the outer one has the form  ψ(ϕ(fx))."
              },
              {
                "num": "3.3.3.3 (4/4)",
                "text": "Only the letter ‘F’ is common to the two functions, but the letter by itself signifies nothing. This immediately becomes clear if instead of ‘F(Fu)’ we write ‘(∃ϕ):F(ϕu).ϕu=Fu’. That disposes of Russell’s paradox.",
                "children": []
              },
              {
                "num": "3.3.3.4",
                "text": "The rules of logical syntax must go without saying, once we know how each individual sign signifies.",
                "children": []
              }
            ]
          },
          {
            "num": "3.3.4",
            "text": "A proposition possesses essential and accidental features. Accidental features are those that result from the particular way in which the propositional sign is produced. Essential features are those without which the proposition could not express its sense.",
            "children": [
              {
                "num": "3.3.4.1",
                "text": "So what is essential in a proposition is what all propositions that can express the same sense have in common. And similarly, in general, what is essential in a symbol is what all symbols that can serve the same purpose have in common.",
                "children": [
                  {
                    "num": "3.3.4.1.1",
                    "text": "So one could say that the real name of an object was what all symbols that signified it had in common. Thus, one by one, all kinds of composition would prove to be unessential to a name.",
                    "children": []
                  }
                ]
              },
              {
                "num": "3.3.4.2",
                "text": "Although there is something arbitrary in our notations, _this much_ is not arbitrary—that _when_ we have determined one thing arbitrarily, something else is necessarily the case. (This derives from the _essence_ of notation.)",
                "children": [
                  {
                    "num": "3.3.4.2.1 (1/2)",
                    "text": "A particular mode of signifying may be unimportant but it is always important that it is a _possible_ mode of signifying."
                  },
                  {
                    "num": "3.3.4.2.1 (2/2)",
                    "text": "And that is generally so in philosophy: again and again the individual case turns out to be unimportant, but the possibility of each individual case discloses something about the essence of the world.",
                    "children": []
                  }
                ]
              },
              {
                "num": "3.3.4.3",
                "text": "Definitions are rules for translating from one language into another. Any correct sign-language must be translatable into any other in accordance with such rules: it is _this_ that they all have in common.",
                "children": []
              },
              {
                "num": "3.3.4.4",
                "text": "What signifies in a symbol is what is common to all the symbols that the rules of logical syntax allow us to substitute for it.",
                "children": [
                  {
                    "num": "3.3.4.4.1 (1/2)",
                    "text": "For instance, we can express what is common to all notations for truth-functions in the following way: they have in common that, for example, the notation that uses ‘~p’ (‘not p’) and ‘p∨q’ (‘p or q’) _can be substituted_ for any of them."
                  },
                  {
                    "num": "3.3.4.4.1 (2/2)",
                    "text": "(This serves to characterize the way in which something general can be disclosed by the possibility of a specific notation.)",
                    "children": []
                  },
                  {
                    "num": "3.3.4.4.2",
                    "text": "Nor does analysis resolve the sign for a complex in an arbitrary way, so that it would have a different resolution every time that it was incorporated in a different proposition.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "num": "3.4",
        "text": "A proposition determines a place in logical space. The existence of this logical place is guaranteed by the mere existence of the constituents—by the existence of the proposition with a sense.",
        "children": [
          {
            "num": "3.4.1",
            "text": "The propositional sign with logical co-ordinates—that is the logical place.",
            "children": [
              {
                "num": "3.4.1.1",
                "text": "In geometry and logic alike a place is a possibility: something can exist in it.",
                "children": []
              }
            ]
          },
          {
            "num": "3.4.2 (1/2)",
            "text": "A proposition can determine only one place in logical space: nevertheless the whole of logical space must already be given by it."
          },
          {
            "num": "3.4.2 (2/2)",
            "text": "(Otherwise negation, logical sum, logical product, etc., would introduce more and more new elements—in co-ordination.) (The logical scaffolding surrounding a picture determines logical space. The force of a proposition reaches through the whole of logical space.)",
            "children": []
          }
        ]
      },
      {
        "num": "3.5",
        "text": "A propositional sign, applied and thought out, is a thought.",
        "children": []
      }
    ]
  },
  {
    "num": "4",
    "text": "A thought is a proposition with a sense.",
    "children": [
      {
        "num": "4.0",
        "text": "",
        "children": [
          {
            "num": "4.0.0",
            "text": "",
            "children": [
              {
                "num": "4.0.0.1",
                "text": "The totality of propositions is language.",
                "children": []
              },
              {
                "num": "4.0.0.2 (1/4)",
                "text": "Man possesses the ability to construct languages capable of expressing every sense, without having any idea how each word has meaning or what its meaning is—just as people speak without knowing how the individual sounds are produced."
              },
              {
                "num": "4.0.0.2 (2/4)",
                "text": "Everyday language is a part of the human organism and is no less complicated than it. It is not humanly possible to gather immediately from it what the logic of language is. Language disguises thought."
              },
              {
                "num": "4.0.0.2 (3/4)",
                "text": "So much so, that from the outward form of the clothing it is impossible to infer the form of the thought beneath it, because the outward form of the clothing is not designed to reveal the form of the body, but for entirely different purposes."
              },
              {
                "num": "4.0.0.2 (4/4)",
                "text": "The tacit conventions on which the understanding of everyday language depends are enormously complicated.",
                "children": []
              },
              {
                "num": "4.0.0.3 (1/3)",
                "text": "Most of the propositions and questions to be found in philosophical works are not false but nonsensical. Consequently we cannot give any answer to questions of this kind, but can only point out that they are nonsensical."
              },
              {
                "num": "4.0.0.3 (2/3)",
                "text": "Most of the propositions and questions of philosophers arise from our failure to understand the logic of our language."
              },
              {
                "num": "4.0.0.3 (3/3)",
                "text": "(They belong to the same class as the question whether the good is more or less identical than the beautiful.) And it is not surprising that the deepest problems are in fact _not_ problems at all.",
                "children": [
                  {
                    "num": "4.0.0.3.1",
                    "text": "All philosophy is a ‘critique of language’ (though not in Mauthner’s sense). It was Russell who performed the service of showing that the apparent logical form of a proposition need not be its real one.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "4.0.1",
            "text": "A proposition is a picture of reality. A proposition is a model of reality as we imagine it.",
            "children": [
              {
                "num": "4.0.1.1 (1/2)",
                "text": "At first sight a proposition—one set out on the printed page, for example—does not seem to be a picture of the reality with which it is concerned."
              },
              {
                "num": "4.0.1.1 (2/2)",
                "text": "But neither do written notes seem at first sight to be a picture of a piece of music, nor our phonetic notation (the alphabet) to be a picture of our speech. And yet these sign-languages prove to be pictures, even in the ordinary sense, of what they represent.",
                "children": []
              },
              {
                "num": "4.0.1.2",
                "text": "It is obvious that a proposition of the form ‘aRb’ strikes us as a picture. In this case the sign is obviously a likeness of what is signified.",
                "children": []
              },
              {
                "num": "4.0.1.3",
                "text": "And if we penetrate to the essence of this pictorial character, we see that it is _not_ impaired by _apparent irregularities_ (such as the use of ♯ and ♭ in musical notation). For even these irregularities depict what they are intended to express; only they do it in a different way.",
                "children": []
              },
              {
                "num": "4.0.1.4 (1/2)",
                "text": "A gramophone record, the musical idea, the written notes, and the sound-waves, all stand to one another in the same internal relation of depicting that holds between language and the world.  They are all constructed according to a common logical pattern."
              },
              {
                "num": "4.0.1.4 (2/2)",
                "text": "(Like the two youths in the fairy-tale, their two horses, and their lilies. They are all in a certain sense one.)",
                "children": [
                  {
                    "num": "4.0.1.4.1 (1/3)",
                    "text": "There is a general rule by means of which the musician can obtain the symphony from the score, and which makes it possible to derive the symphony from the groove on the gramophone record, and, using the first rule, to derive the score again."
                  },
                  {
                    "num": "4.0.1.4.1 (2/3)",
                    "text": "That is what constitutes the inner similarity between these things which seem to be constructed in such entirely different ways. And that rule is the law of projection which projects the symphony into the language of musical notation."
                  },
                  {
                    "num": "4.0.1.4.1 (3/3)",
                    "text": "It is the rule for translating this language into the language of gramophone records.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.0.1.5",
                "text": "The possibility of all imagery, of all our pictorial modes of expression, is contained in the logic of depiction.",
                "children": []
              },
              {
                "num": "4.0.1.6",
                "text": "In order to understand the essential nature of a proposition, we should consider hieroglyphic script, which depicts the facts that it describes. And alphabetic script developed out of it without losing what was essential to depiction.",
                "children": []
              }
            ]
          },
          {
            "num": "4.0.2",
            "text": "We can see this from the fact that we understand the sense of a propositional sign without its having been explained to us.",
            "children": [
              {
                "num": "4.0.2.1",
                "text": "A proposition is a picture of reality: for if I understand a proposition, I know the situation that it represents. And I understand the proposition without having had its sense explained to me.",
                "children": []
              },
              {
                "num": "4.0.2.2",
                "text": "A proposition _shows_ its sense. A proposition _shows_ how things stand _if_ it is true. And it _says that_ they do so stand.",
                "children": []
              },
              {
                "num": "4.0.2.3 (1/3)",
                "text": "A proposition must restrict reality to two alternatives: yes or no. In order to do that, it must describe reality completely. A proposition is a description of a state of affairs."
              },
              {
                "num": "4.0.2.3 (2/3)",
                "text": "Just as a description of an object describes it by giving its external properties, so a proposition describes reality by its internal properties."
              },
              {
                "num": "4.0.2.3 (3/3)",
                "text": "A proposition constructs a world with the help of a logical scaffolding, so that one can actually see from the proposition how everything stands logically _if_ it is true. One can _draw inferences_ from a false proposition.",
                "children": []
              },
              {
                "num": "4.0.2.4",
                "text": "To understand a proposition means to know what is the case if it is true. (One can understand it, therefore, without knowing whether it is true.) It is understood by anyone who understands its constituents.",
                "children": []
              },
              {
                "num": "4.0.2.5 (1/2)",
                "text": "When translating one language into another, we do not proceed by translating each _proposition_ of the one into a _proposition_ of the other, but merely by translating the constituents of propositions."
              },
              {
                "num": "4.0.2.5 (2/2)",
                "text": "(And the dictionary translates not only substantives, but also verbs, adjectives, and conjunctions, etc.; and it treats them all in the same way.)",
                "children": []
              },
              {
                "num": "4.0.2.6",
                "text": "The meanings of simple signs (words) must be explained to us if we are to understand them. With propositions, however, we make ourselves understood.",
                "children": []
              },
              {
                "num": "4.0.2.7",
                "text": "It belongs to the essence of a proposition that it should be able to communicate a _new_ sense to us.",
                "children": []
              }
            ]
          },
          {
            "num": "4.0.3 (1/2)",
            "text": "A proposition must use old expressions to communicate a new sense. A proposition communicates a situation to us, and so it must be _essentially_ connected with the situation. And the connexion is precisely that it is its logical picture."
          },
          {
            "num": "4.0.3 (2/2)",
            "text": "A proposition states something only in so far as it is a picture.",
            "children": [
              {
                "num": "4.0.3.1",
                "text": "In a proposition a situation is, as it were, constructed by way of experiment. Instead of, ‘This proposition has such and such a sense’, we can simply say, ‘This proposition represents such and such a situation’.",
                "children": [
                  {
                    "num": "4.0.3.1.1",
                    "text": "One name stands for one thing, another for another thing, and they are combined with one another. In this way the whole group—like a _tableau vivant_—presents a state of affairs.",
                    "children": []
                  },
                  {
                    "num": "4.0.3.1.2",
                    "text": "The possibility of propositions is based on the principle that objects have signs as their representatives. My fundamental idea is that the ‘logical constants’ are not representatives; that there can be no representatives of the _logic_ of facts.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.0.3.2",
                "text": "It is only in so far as a proposition is logically articulated that it is a picture of a situation. (Even the proposition, _Ambulo_, is composite: for its stem with a different ending yields a different sense, and so does its ending with a different stem.)",
                "children": []
              }
            ]
          },
          {
            "num": "4.0.4",
            "text": "In a proposition there must be exactly as many distinguishable parts as in the situation that it represents. The two must possess the same logical (mathematical) multiplicity. (Compare Hertz’s Mechanics on dynamical models.)",
            "children": [
              {
                "num": "4.0.4.1",
                "text": "This mathematical multiplicity, of course, cannot itself be the subject of depiction. One cannot get away from it when depicting.",
                "children": [
                  {
                    "num": "4.0.4.1.1 (1/4)",
                    "text": "If, for example, we wanted to express what we now write as ‘(x).fx’ by putting an affix in front of ‘fx’—for instance by writing ‘Gen.fx’—it would not be adequate: we should not know what was being generalized."
                  },
                  {
                    "num": "4.0.4.1.1 (2/4)",
                    "text": "If we wanted to signalize it with an affix ‘g’—for instance by writing ‘f(xg)’—that would not be adequate either: we should not know the scope of the generality-sign."
                  },
                  {
                    "num": "4.0.4.1.1 (3/4)",
                    "text": "If we were to try to do it by introducing a mark into the argument-places—for instance by writing ‘(G, G).F(G, G)’ —it would not be adequate: we should not be able to establish the identity of the variables. And so on."
                  },
                  {
                    "num": "4.0.4.1.1 (4/4)",
                    "text": "All these modes of signifying are inadequate because they lack the necessary mathematical multiplicity.",
                    "children": []
                  },
                  {
                    "num": "4.0.4.1.2",
                    "text": "For the same reason the idealist’s appeal to ‘spatial spectacles’ is inadequate to explain the seeing of spatial relations, because it cannot explain the multiplicity of these relations.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "4.0.5",
            "text": "Reality is compared with propositions.",
            "children": []
          },
          {
            "num": "4.0.6",
            "text": "A proposition can be true or false only in virtue of being a picture of reality.",
            "children": [
              {
                "num": "4.0.6.1 (1/2)",
                "text": "It must not be overlooked that a proposition has a sense that is independent of the facts: otherwise one can easily suppose that true and false are relations of equal status between signs and what they signify."
              },
              {
                "num": "4.0.6.1 (2/2)",
                "text": "In that case one could say, for example, that ‘p’ signified in the true way what ‘~p’ signified in the false way, etc.",
                "children": []
              },
              {
                "num": "4.0.6.2 (1/2)",
                "text": "Can we not make ourselves understood with false propositions just as we have done up till now with true ones?—So long as it is known that they are meant to be false.—No!"
              },
              {
                "num": "4.0.6.2 (2/2)",
                "text": "For a proposition is true if we use it to say that things stand in a certain way, and they do; and if by ‘p’ we mean ~p and things stand as we mean that they do, then, construed in the new way, ‘p’ is true and not false.",
                "children": [
                  {
                    "num": "4.0.6.2.1 (1/2)",
                    "text": "But it is important that the signs ‘p’ and ‘~p’ can say the same thing. For it shows that nothing in reality corresponds to the sign ‘~’. The occurrence of negation in a proposition is not enough to characterize its sense (~~p=p)."
                  },
                  {
                    "num": "4.0.6.2.1 (2/2)",
                    "text": "The propositions ‘p’ and ‘~p’ have opposite sense, but there corresponds to them one and the same reality.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.0.6.3 (1/8)",
                "text": "An analogy to illustrate the concept of truth: imagine a black spot on white paper: you can describe the shape of the spot by saying, for each point on the sheet, whether it is black or white."
              },
              {
                "num": "4.0.6.3 (2/8)",
                "text": "To the fact that a point is black there corresponds a positive fact, and to the fact that a point is white (not black), a negative fact."
              },
              {
                "num": "4.0.6.3 (3/8)",
                "text": "If I designate a point on the sheet (a truth-value according to Frege), then this corresponds to the supposition that is put forward for judgement, etc. etc."
              },
              {
                "num": "4.0.6.3 (4/8)",
                "text": "But in order to be able to say that a point is black or white, I must first know when a point is called black, and when white:"
              },
              {
                "num": "4.0.6.3 (5/8)",
                "text": "in order to be able to say, ‘“p” is true (or false)’, I must have determined in what circumstances I call ‘p’ true, and in so doing I determine the sense of the proposition."
              },
              {
                "num": "4.0.6.3 (6/8)",
                "text": "Now the point where the simile breaks down is this:"
              },
              {
                "num": "4.0.6.3 (7/8)",
                "text": "we can indicate a point on the paper even if we do not know what black and white are, but if a proposition has no sense, nothing corresponds to it, since it does not designate a thing (a truth-value) which might have properties called ‘false’ or ‘true’."
              },
              {
                "num": "4.0.6.3 (8/8)",
                "text": "The verb of a proposition is not ‘is true’ or ‘is false’, as Frege thought: rather, that which ‘is true’ must already contain the verb.",
                "children": []
              },
              {
                "num": "4.0.6.4",
                "text": "Every proposition must _already_ have a sense: it cannot be given a sense by affirmation. Indeed its sense is just what is affirmed. And the same applies to negation, etc.",
                "children": [
                  {
                    "num": "4.0.6.4.1 (1/3)",
                    "text": "One could say that negation must be related to the logical place determined by the negated proposition. The negating proposition determines a logical place _different_ from that of the negated proposition."
                  },
                  {
                    "num": "4.0.6.4.1 (2/3)",
                    "text": "The negating proposition determines a logical place with the help of the logical place of the negated proposition. For it describes it as lying outside the latter’s logical place."
                  },
                  {
                    "num": "4.0.6.4.1 (3/3)",
                    "text": "The negated proposition can be negated again, and this in itself shows that what is negated is already a proposition, and not merely something that is preliminary to a proposition.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "num": "4.1",
        "text": "Propositions represent the existence and non-existence of states of affairs.",
        "children": [
          {
            "num": "4.1.1",
            "text": "The totality of true propositions is the whole of natural science (or the whole corpus of the natural sciences).",
            "children": [
              {
                "num": "4.1.1.1",
                "text": "Philosophy is not one of the natural sciences. (The word ‘philosophy’ must mean something whose place is above or below the natural sciences, not beside them.)",
                "children": []
              },
              {
                "num": "4.1.1.2 (1/2)",
                "text": "Philosophy aims at the logical clarification of thoughts. Philosophy is not a body of doctrine but an activity. A philosophical work consists essentially of elucidations. Philosophy does not result in ‘philosophical propositions’, but rather in the clarification of propositions."
              },
              {
                "num": "4.1.1.2 (2/2)",
                "text": "Without philosophy thoughts are, as it were, cloudy and indistinct: its task is to make them clear and to give them sharp boundaries.",
                "children": [
                  {
                    "num": "4.1.1.2.1 (1/3)",
                    "text": "Psychology is no more closely related to philosophy than any other natural science. Theory of knowledge is the philosophy of psychology."
                  },
                  {
                    "num": "4.1.1.2.1 (2/3)",
                    "text": "Does not my study of sign-language correspond to the study of thought-processes, which philosophers used to consider so essential to the philosophy of logic?"
                  },
                  {
                    "num": "4.1.1.2.1 (3/3)",
                    "text": "Only in most cases they got entangled in unessential psychological investigations, and with my method too there is an analogous risk.",
                    "children": []
                  },
                  {
                    "num": "4.1.1.2.2",
                    "text": "Darwin’s theory has no more to do with philosophy than any other hypothesis in natural science.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.1.1.3",
                "text": "Philosophy sets limits to the much disputed sphere of natural science.",
                "children": []
              },
              {
                "num": "4.1.1.4",
                "text": "It must set limits to what can be thought; and, in doing so, to what cannot be thought. It must set limits to what cannot be thought by working outwards through what can be thought.",
                "children": []
              },
              {
                "num": "4.1.1.5",
                "text": "It will signify what cannot be said, by presenting clearly what can be said.",
                "children": []
              },
              {
                "num": "4.1.1.6",
                "text": "Everything that can be thought at all can be thought clearly. Everything that can be put into words can be put clearly.",
                "children": []
              }
            ]
          },
          {
            "num": "4.1.2 (1/2)",
            "text": "Propositions can represent the whole of reality, but they cannot represent what they must have in common with reality in order to be able to represent it—logical form."
          },
          {
            "num": "4.1.2 (2/2)",
            "text": "In order to be able to represent logical form, we should have to be able to station ourselves with propositions somewhere outside logic, that is to say outside the world.",
            "children": [
              {
                "num": "4.1.2.1",
                "text": "Propositions cannot represent logical form: it is mirrored in them. What finds its reflection in language, language cannot represent. What expresses _itself_ in language, _we_ cannot express by means of language. Propositions _show_ the logical form of reality. They display it.",
                "children": [
                  {
                    "num": "4.1.2.1.1 (1/2)",
                    "text": "Thus one proposition ‘fa’ shows that the object a occurs in its sense, two propositions ‘fa’ and ‘ga’ show that the same object is mentioned in both of them."
                  },
                  {
                    "num": "4.1.2.1.1 (2/2)",
                    "text": "If two propositions contradict one another, then their structure shows it; the same is true if one of them follows from the other. And so on.",
                    "children": []
                  },
                  {
                    "num": "4.1.2.1.2",
                    "text": "What _can_ be shown, _cannot_ be said.",
                    "children": []
                  },
                  {
                    "num": "4.1.2.1.3",
                    "text": "Now, too, we understand our feeling that once we have a sign-language in which everything is all right, we already have a correct logical point of view.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.1.2.2 (1/4)",
                "text": "In a certain sense we can talk about formal properties of objects and states of affairs, or, in the case of facts, about structural properties: and in the same sense about formal relations and structural relations."
              },
              {
                "num": "4.1.2.2 (2/4)",
                "text": "(Instead of ‘structural property’ I also say ‘internal property’; instead of ‘structural relation’, ‘internal relation’."
              },
              {
                "num": "4.1.2.2 (3/4)",
                "text": "I introduce these expressions in order to indicate the source of the confusion between internal relations and relations proper (external relations), which is very widespread among philosophers.)"
              },
              {
                "num": "4.1.2.2 (4/4)",
                "text": "It is impossible, however, to assert by means of propositions that such internal properties and relations obtain: rather, this makes itself manifest in the propositions that represent the relevant states of affairs and are concerned with the relevant objects.",
                "children": [
                  {
                    "num": "4.1.2.2.1",
                    "text": "An internal property of a fact can also be called a feature of that fact (in the sense in which we speak of facial features, for example).",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.1.2.3 (1/2)",
                "text": "A property is internal if it is unthinkable that its object should not possess it. (This shade of blue and that one stand, _eo ipso_, in the internal relation of lighter to darker."
              },
              {
                "num": "4.1.2.3 (2/2)",
                "text": "It is unthinkable that _these_ two objects should not stand in this relation.) (Here the shifting use of the word ‘object’ corresponds to the shifting use of the words ‘property’ and ‘relation’.)",
                "children": []
              },
              {
                "num": "4.1.2.4 (1/2)",
                "text": "The existence of an internal property of a possible situation is not expressed by means of a proposition: rather, it expresses itself in the proposition representing the situation, by means of an internal property of that proposition."
              },
              {
                "num": "4.1.2.4 (2/2)",
                "text": "It would be just as nonsensical to assert that a proposition had a formal property as to deny it.",
                "children": [
                  {
                    "num": "4.1.2.4.1",
                    "text": "It is impossible to distinguish forms from one another by saying that one has this property and another that property: for this presupposes that it makes sense to ascribe either property to either form.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.1.2.5",
                "text": "The existence of an internal relation between possible situations expresses itself in language by means of an internal relation between the propositions representing them.",
                "children": [
                  {
                    "num": "4.1.2.5.1",
                    "text": "Here we have the answer to the vexed question ‘whether all relations are internal or external’.",
                    "children": []
                  },
                  {
                    "num": "4.1.2.5.2 (1/2)",
                    "text": "I call a series that is ordered by an internal relation a series of forms. The order of the number-series is not governed by an external relation but by an internal relation. The same is true of the series of propositions ‘aRb’, ‘(∃x):aRx.xRb’, ‘(∃x,y):aRx.xRy.yRb’, and so forth."
                  },
                  {
                    "num": "4.1.2.5.2 (2/2)",
                    "text": "(If b stands in one of these relations to a, I call b a successor of a.)",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.1.2.6 (1/6)",
                "text": "We can now talk about formal concepts, in the same sense that we speak of formal properties."
              },
              {
                "num": "4.1.2.6 (2/6)",
                "text": "(I introduce this expression in order to exhibit the source of the confusion between formal concepts and concepts proper, which pervades the whole of traditional logic.)"
              },
              {
                "num": "4.1.2.6 (3/6)",
                "text": "When something falls under a formal concept as one of its objects, this cannot be expressed by means of a proposition. Instead it is shown in the very sign for this object."
              },
              {
                "num": "4.1.2.6 (4/6)",
                "text": "(A name shows that it signifies an object, a sign for a number that it signifies a number, etc.) Formal concepts cannot, in fact, be represented by means of a function, as concepts proper can. For their characteristics, formal properties, are not expressed by means of functions."
              },
              {
                "num": "4.1.2.6 (5/6)",
                "text": "The expression for a formal property is a feature of certain symbols. So the sign for the characteristics of a formal concept is a distinctive feature of all symbols whose meanings fall under the concept."
              },
              {
                "num": "4.1.2.6 (6/6)",
                "text": "So the expression for a formal concept is a propositional variable in which this distinctive feature alone is constant.",
                "children": []
              },
              {
                "num": "4.1.2.7",
                "text": "The propositional variable signifies the formal concept, and its values signify the objects that fall under the concept.",
                "children": [
                  {
                    "num": "4.1.2.7.1",
                    "text": "Every variable is the sign for a formal concept. For every variable represents a constant form that all its values possess, and this can be regarded as a formal property of those values.",
                    "children": []
                  },
                  {
                    "num": "4.1.2.7.2 (1/5)",
                    "text": "Thus the variable name ‘x’ is the proper sign for the pseudo-concept _object_. Wherever the word ‘object’ (‘thing’, etc.) is correctly used, it is expressed in conceptual notation by a variable name."
                  },
                  {
                    "num": "4.1.2.7.2 (2/5)",
                    "text": "For example, in the proposition, ‘There are 2 objects which …’, it is expressed by ‘(∃x,y)…’. Wherever it is used in a different way, that is as a proper concept-word, nonsensical pseudo-propositions are the result."
                  },
                  {
                    "num": "4.1.2.7.2 (3/5)",
                    "text": "So one cannot say, for example, ‘There are objects’, as one might say, ‘There are books’. And it is just as impossible to say, ‘There are 100 objects’, or, ‘There are ℵ0 objects’. And it is nonsensical to speak of the _total number of objects_."
                  },
                  {
                    "num": "4.1.2.7.2 (4/5)",
                    "text": "The same applies to the words ‘complex’, ‘fact’, ‘function’, ‘number’, etc. They all signify formal concepts, and are represented in conceptual notation by variables, not by functions or classes (as Frege and Russell believed)."
                  },
                  {
                    "num": "4.1.2.7.2 (5/5)",
                    "text": "‘1 is a number’, ‘There is only one zero’, and all similar expressions are nonsensical. (It is just as nonsensical to say, ‘There is only one 1’, as it would be to say, ‘2+2 at 3 o’clock equals 4’.)",
                    "children": [
                      {
                        "num": "4.1.2.7.2.1 (1/2)",
                        "text": "A formal concept is given immediately any object falling under it is given. It is not possible, therefore, to introduce as primitive ideas objects belonging to a formal concept _and_ the formal concept itself."
                      },
                      {
                        "num": "4.1.2.7.2.1 (2/2)",
                        "text": "So it is impossible, for example, to introduce as primitive ideas both the concept of a function and specific functions, as Russell does; or the concept of a number and particular numbers.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "num": "4.1.2.7.3 (1/2)",
                    "text": "If we want to express in conceptual notation the general proposition, ‘b is a successor of a’, then we require an expression for the general term of the series of forms aRb, (∃x):aRx.xRb,"
                  },
                  {
                    "num": "4.1.2.7.3 (2/2)",
                    "text": "(∃x,y):aRx.xRy.yRb We can determine the general term of a series of forms by giving its first term and the general form of the operation that produces the next term out of the proposition that precedes it.",
                    "children": []
                  },
                  {
                    "num": "4.1.2.7.4",
                    "text": "To ask whether a formal concept exists is nonsensical. For no proposition can be the answer to such a question. (So, for example, the question, ‘Are there unanalysable subject-predicate propositions?’ cannot be asked.)",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.1.2.8",
                "text": "Logical forms are _without_ number. Hence there are no pre-eminent numbers in logic, and hence there is no possibility of philosophical monism or dualism, etc.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "4.2",
        "text": "The sense of a proposition is its agreement and disagreement with possibilities of existence and non-existence of states of affairs.",
        "children": [
          {
            "num": "4.2.1",
            "text": "The simplest kind of proposition, an elementary proposition, asserts the existence of a state of affairs.",
            "children": [
              {
                "num": "4.2.1.1",
                "text": "It is a sign of a proposition’s being elementary that there can be no elementary proposition contradicting it.",
                "children": []
              }
            ]
          },
          {
            "num": "4.2.2",
            "text": "An elementary proposition consists of names. It is a nexus, a concatenation, of names.",
            "children": [
              {
                "num": "4.2.2.1",
                "text": "It is obvious that the analysis of propositions must bring us to elementary propositions which consist of names in immediate combination. This raises the question how such combination into propositions comes about.",
                "children": [
                  {
                    "num": "4.2.2.1.1",
                    "text": "Even if the world is infinitely complex, so that every fact consists of infinitely many states of affairs and every state of affairs is composed of infinitely many objects, there would still have to be objects and states of affairs.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "4.2.3",
            "text": "It is only in the nexus of an elementary proposition that a name occurs in a proposition.",
            "children": []
          },
          {
            "num": "4.2.4",
            "text": "Names are the simple symbols: I indicate them by single letters (‘x’, ‘y’, ‘z’). I write elementary propositions as functions of names, so that they have the form ‘fx’, ‘ϕ(x,y)’, etc. Or I indicate them by the letters ‘p’, ‘q’, ‘r’.",
            "children": [
              {
                "num": "4.2.4.1 (1/2)",
                "text": "When I use two signs with one and the same meaning, I express this by putting the sign ‘=’ between them. So ‘a=b’ means that the sign ‘b’ can be substituted for the sign ‘a’."
              },
              {
                "num": "4.2.4.1 (2/2)",
                "text": "(If I use an equation to introduce a new sign ‘b’, laying down that it shall serve as a substitute for a sign ‘a’ that is already known, then, like Russell, I write the equation—definition—in the form ‘a=b Def.’ A definition is a rule dealing with signs.)",
                "children": []
              },
              {
                "num": "4.2.4.2",
                "text": "Expressions of the form ‘a=b’ are, therefore, mere representational devices. They state nothing about the meaning of the signs ‘a’ and ‘b’.",
                "children": []
              },
              {
                "num": "4.2.4.3 (1/3)",
                "text": "Can we understand two names without knowing whether they signify the same thing or two different things?—Can we understand a proposition in which two names occur without knowing whether their meaning is the same or different?"
              },
              {
                "num": "4.2.4.3 (2/3)",
                "text": "Suppose I know the meaning of an English word and of a German word that means the same: then it is impossible for me to be unaware that they do mean the same; I must be capable of translating each into the other."
              },
              {
                "num": "4.2.4.3 (3/3)",
                "text": "Expressions like ‘a=a’, and those derived from them, are neither elementary propositions nor is there any other way in which they have sense. (This will become evident later.)",
                "children": []
              }
            ]
          },
          {
            "num": "4.2.5",
            "text": "If an elementary proposition is true, the state of affairs exists: if an elementary proposition is false, the state of affairs does not exist.",
            "children": []
          },
          {
            "num": "4.2.6",
            "text": "If all true elementary propositions are given, the result is a complete description of the world. The world is completely described by giving all elementary propositions, and adding which of them are true and which false.",
            "children": []
          },
          {
            "num": "4.2.7",
            "text": "For n states of affairs, there are [Kn = sum from nu = 0 to n of (n choose nu)] [IMAGE-427]  possibilities of existence and non-existence.  Of these states of affairs any combination can exist and the remainder not exist.",
            "children": []
          },
          {
            "num": "4.2.8",
            "text": "There correspond to these combinations the same number of possibilities of truth—and falsity—for n elementary propositions.",
            "children": []
          }
        ]
      },
      {
        "num": "4.3",
        "text": "Truth-possibilities of elementary propositions mean possibilities of existence and non-existence of states of affairs.",
        "children": [
          {
            "num": "4.3.1",
            "text": "We can represent truth-possibilities by schemata of the following kind (‘T’ means ‘true’, ‘F’ means ‘false’; the rows of ‘T’s’ and ‘F’s’ under the row of elementary propositions symbolize their truth-possibilities in a way that can easily be understood): [IMAGE-431] pqTTFTTFFFpTF",
            "children": []
          }
        ]
      },
      {
        "num": "4.4",
        "text": "A proposition is an expression of agreement and disagreement with truth-possibilities of elementary propositions.",
        "children": [
          {
            "num": "4.4.1",
            "text": "Truth-possibilities of elementary propositions are the conditions of the truth and falsity of propositions.",
            "children": [
              {
                "num": "4.4.1.1",
                "text": "It immediately strikes one as probable that the introduction of elementary propositions provides the basis for understanding all other kinds of proposition. Indeed the understanding of general propositions _palpably_ depends on the understanding of elementary propositions.",
                "children": []
              }
            ]
          },
          {
            "num": "4.4.2",
            "text": "For n elementary propositions there are [sum from kappa = 0 to Kn of (Kn choose kappa) = Ln][IMAGE-442]  ways in which a proposition can agree and disagree with their truth possibilities.",
            "children": []
          },
          {
            "num": "4.4.3",
            "text": "We can express agreement with truth-possibilities by correlating the mark ‘T’ (true) with them in the schema. The absence of this mark means disagreement.",
            "children": [
              {
                "num": "4.4.3.1 (1/3)",
                "text": "The expression of agreement and disagreement with the truth possibilities of elementary propositions expresses the truth-conditions of a proposition. A proposition is the expression of its truth-conditions."
              },
              {
                "num": "4.4.3.1 (2/3)",
                "text": "(Thus Frege was quite right to use them as a starting point when he explained the signs of his conceptual notation."
              },
              {
                "num": "4.4.3.1 (3/3)",
                "text": "But the explanation of the concept of truth that Frege gives is mistaken: if ‘the true’ and ‘the false’ were really objects, and were the arguments in ~p etc., then Frege’s method of determining the sense of ‘~p’ would leave it absolutely undetermined.)",
                "children": []
              }
            ]
          },
          {
            "num": "4.4.4",
            "text": "The sign that results from correlating the mark ‘T’ with truth-possibilities is a propositional sign.",
            "children": [
              {
                "num": "4.4.4.1 (1/2)",
                "text": "It is clear that a complex of the signs ‘F’ and ‘T’ has no object (or complex of objects) corresponding to it, just as there is none corresponding to the horizontal and vertical lines or to the brackets.—There are no ‘logical objects’."
              },
              {
                "num": "4.4.4.1 (2/2)",
                "text": "Of course the same applies to all signs that express what the schemata of ‘T’s’ and ‘F’s’ express.",
                "children": []
              },
              {
                "num": "4.4.4.2 (1/4)",
                "text": "For example, the following is a propositional sign: [IMAGE-4442]  (Frege’s ‘judgement stroke’ ‘⊢’ is logically quite meaningless: in the works of Frege (and Russell) it simply indicates that these authors hold the propositions marked with this sign to be true."
              },
              {
                "num": "4.4.4.2 (2/4)",
                "text": "Thus ‘⊢’ is no more a component part of a proposition than is, for instance, the proposition’s number."
              },
              {
                "num": "4.4.4.2 (3/4)",
                "text": "It is quite impossible for a proposition to state that it itself is true.) If the order or the truth-possibilities in a schema is fixed once and for all by a combinatory rule, then the last column by itself will be an expression of the truth-conditions."
              },
              {
                "num": "4.4.4.2 (4/4)",
                "text": "If we now write this column as a row, the propositional sign will become “(TT–T)  (p, q)”, or more explicitly “(TTFT)  (p, q)”. (The number of places in the left-hand pair of brackets is determined by the number of terms in the right-hand pair.)",
                "children": []
              }
            ]
          },
          {
            "num": "4.4.5",
            "text": "For n elementary propositions there are Ln possible groups of truth-conditions. The groups of truth-conditions that are obtainable from the truth-possibilities of a given number of elementary propositions can be arranged in a series.",
            "children": []
          },
          {
            "num": "4.4.6 (1/2)",
            "text": "Among the possible groups of truth-conditions there are two extreme cases. In one of these cases the proposition is true for all the truth-possibilities of the elementary propositions. We say that the truth-conditions are _tautological_."
          },
          {
            "num": "4.4.6 (2/2)",
            "text": "In the second case the proposition is false for all the truth-possibilities: the truth-conditions are _contradictory_. In the first case we call the proposition a tautology; in the second, a contradiction.",
            "children": [
              {
                "num": "4.4.6.1 (1/2)",
                "text": "Propositions show what they say: tautologies and contradictions show that they say nothing. A tautology has no truth-conditions, since it is unconditionally true: and a contradiction is true on no condition. Tautologies and contradictions lack sense."
              },
              {
                "num": "4.4.6.1 (2/2)",
                "text": "(Like a point from which two arrows go out in opposite directions to one another.) (For example, I know nothing about the weather when I know that it is either raining or not raining.)",
                "children": [
                  {
                    "num": "4.4.6.1.1",
                    "text": "Tautologies and contradictions are not, however, nonsensical. They are part of the symbolism, much as ‘0’ is part of the symbolism of arithmetic.",
                    "children": []
                  }
                ]
              },
              {
                "num": "4.4.6.2 (1/2)",
                "text": "Tautologies and contradictions are not pictures of reality. They do not represent any possible situations. For the former admit _all_ possible situations, and latter _none_."
              },
              {
                "num": "4.4.6.2 (2/2)",
                "text": "In a tautology the conditions of agreement with the world—the representational relations—cancel one another, so that it does not stand in any representational relation to reality.",
                "children": []
              },
              {
                "num": "4.4.6.3 (1/3)",
                "text": "The truth-conditions of a proposition determine the range that it leaves open to the facts."
              },
              {
                "num": "4.4.6.3 (2/3)",
                "text": "(A proposition, a picture, or a model is, in the negative sense, like a solid body that restricts the freedom of movement of others, and, in the positive sense, like a space bounded by solid substance in which there is room for a body.)"
              },
              {
                "num": "4.4.6.3 (3/3)",
                "text": "A tautology leaves open to reality the whole—the infinite whole—of logical space: a contradiction fills the whole of logical space leaving no point of it for reality. Thus neither of them can determine reality in any way.",
                "children": []
              },
              {
                "num": "4.4.6.4",
                "text": "A tautology’s truth is certain, a proposition’s possible, a contradiction’s impossible. (Certain, possible, impossible: here we have the first indication of the scale that we need in the theory of probability.)",
                "children": []
              },
              {
                "num": "4.4.6.5",
                "text": "The logical product of a tautology and a proposition says the same thing as the proposition. This product, therefore, is identical with the proposition. For it is impossible to alter what is essential to a symbol without altering its sense.",
                "children": []
              },
              {
                "num": "4.4.6.6 (1/3)",
                "text": "What corresponds to a determinate logical combination of signs is a determinate logical combination of their meanings. It is only to the uncombined signs that _absolutely any_ combination corresponds."
              },
              {
                "num": "4.4.6.6 (2/3)",
                "text": "In other words, propositions that are true for every situation cannot be combinations of signs at all, since, if they were, only determinate combinations of objects could correspond to them."
              },
              {
                "num": "4.4.6.6 (3/3)",
                "text": "(And what is not a logical combination has _no_ combination of objects corresponding to it.) Tautology and contradiction are the limiting cases—indeed the disintegration—of the combination of signs.",
                "children": [
                  {
                    "num": "4.4.6.6.1",
                    "text": "Admittedly the signs are still combined with one another even in tautologies and contradictions—i.e. they stand in certain relations to one another: but these relations have no meaning, they are not essential to the _symbol_.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "num": "4.5 (1/4)",
        "text": "It now seems possible to give the most general propositional form:"
      },
      {
        "num": "4.5 (2/4)",
        "text": "that is, to give a description of the propositions of _any_ sign-language _whatsoever_ in such a way that every possible sense can be expressed by a symbol satisfying the description, and every symbol satisfying the description can express a sense,"
      },
      {
        "num": "4.5 (3/4)",
        "text": "provided that the meanings of the names are suitably chosen. It is clear that _only_ what is essential to the most general propositional form may be included in its description—for otherwise it would not be the most general form."
      },
      {
        "num": "4.5 (4/4)",
        "text": "The existence of a general propositional form is proved by the fact that there cannot be a proposition whose form could not have been foreseen (i.e. constructed). The general form of a proposition is: This is how things stand.",
        "children": [
          {
            "num": "4.5.1",
            "text": "Suppose that I am given _all_ elementary propositions: then I can simply ask what propositions I can construct out of them. And there I have _all_ propositions, and _that_ fixes their limits.",
            "children": []
          },
          {
            "num": "4.5.2",
            "text": "Propositions comprise all that follows from the totality of all elementary propositions (and, of course, from its being the _totality_ of them _all_). (Thus, in a certain sense, it could be said that _all_ propositions were generalizations of elementary propositions.)",
            "children": []
          },
          {
            "num": "4.5.3",
            "text": "The general propositional form is a variable.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "num": "5",
    "text": "A proposition is a truth-function of elementary propositions. (An elementary proposition is a truth-function of itself.)",
    "children": [
      {
        "num": "5.0",
        "text": "",
        "children": [
          {
            "num": "5.0.1",
            "text": "Elementary propositions are the truth-arguments of propositions.",
            "children": []
          },
          {
            "num": "5.0.2 (1/5)",
            "text": "The arguments of functions are readily confused with the affixes of names. For both arguments and affixes enable me to recognize the meaning of the signs containing them."
          },
          {
            "num": "5.0.2 (2/5)",
            "text": "For example, when Russell writes ‘+c’, the ‘c’ is an affix which indicates that the sign as a whole is the addition-sign for cardinal numbers."
          },
          {
            "num": "5.0.2 (3/5)",
            "text": "But the use of this sign is the result of arbitrary convention and it would be quite possible to choose a simple sign instead of ‘+c’; in ‘~p’, however, ‘p’ is not an affix but an argument: the sense of ‘~p’ _cannot_ be understood unless the sense of ‘p’ has been understood already."
          },
          {
            "num": "5.0.2 (4/5)",
            "text": "(In the name Julius Caesar ‘Julius’ is an affix. An affix is always part of a description of the object to whose name we attach it: e.g."
          },
          {
            "num": "5.0.2 (5/5)",
            "text": "_the_ Caesar of the Julian gens.) If I am not mistaken, Frege’s theory about the meaning of propositions and functions is based on the confusion between an argument and an affix. Frege regarded the propositions of logic as names, and their arguments as the affixes of those names.",
            "children": []
          }
        ]
      },
      {
        "num": "5.1",
        "text": "Truth-functions can be arranged in series. That is the foundation of the theory of probability.",
        "children": [
          {
            "num": "5.1.0",
            "text": "",
            "children": [
              {
                "num": "5.1.0.1 (1/2)",
                "text": "The truth-functions of a given number of elementary propositions can always be set out in a schema of the following kind: I will give the name _truth-grounds_ of a proposition to those truth-possibilities of its truth-arguments that make it true."
              },
              {
                "num": "5.1.0.1 (2/2)",
                "text": "[IMAGE-5101] I will give the name _truth-grounds_ of a proposition to those truth-possibilities of its truth-arguments that make it true.",
                "children": []
              }
            ]
          },
          {
            "num": "5.1.1",
            "text": "If all the truth-grounds that are common to a number of propositions are at the same time truth-grounds of a certain proposition, then we say that the truth of that proposition follows from the truth of the others.",
            "children": []
          },
          {
            "num": "5.1.2",
            "text": "In particular, the truth of a proposition ‘p’ follows from the truth of another proposition ‘q’ if all the truth-grounds of the latter are truth-grounds of the former.",
            "children": [
              {
                "num": "5.1.2.1",
                "text": "The truth-grounds of the one are contained in those of the other: p follows from q.",
                "children": []
              },
              {
                "num": "5.1.2.2",
                "text": "If p follows from q, the sense of ‘p’ is contained in the sense of ‘q’.",
                "children": []
              },
              {
                "num": "5.1.2.3",
                "text": "If a god creates a world in which certain propositions are true, then by that very act he also creates a world in which all the propositions that follow from them come true. And similarly he could not create a world in which the proposition ‘p’ was true without creating all its objects.",
                "children": []
              },
              {
                "num": "5.1.2.4",
                "text": "A proposition affirms every proposition that follows from it.",
                "children": [
                  {
                    "num": "5.1.2.4.1",
                    "text": "‘p.q’ is one of the propositions that affirm ‘p’ and at the same time one of the propositions that affirm ‘q’. Two propositions are opposed to one another if there is no proposition with a sense, that affirms them both. Every proposition that contradicts another negates it.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.1.3",
            "text": "When the truth of one proposition follows from the truth of others, we can see this from the structure of the propositions.",
            "children": [
              {
                "num": "5.1.3.1 (1/2)",
                "text": "If the truth of one proposition follows from the truth of others, this finds expression in relations in which the forms of the propositions stand to one another:"
              },
              {
                "num": "5.1.3.1 (2/2)",
                "text": "nor is it necessary for us to set up these relations between them, by combining them with one another in a single proposition; on the contrary, the relations are internal, and their existence is an immediate result of the existence of the propositions.",
                "children": [
                  {
                    "num": "5.1.3.1.1 (1/2)",
                    "text": "When we infer q from p∨q and ~p, the relation between the propositional forms of ‘p∨q’ and ‘~p’ is masked, in this case, by our mode of signifying."
                  },
                  {
                    "num": "5.1.3.1.1 (2/2)",
                    "text": "But if instead of ‘p∨q’ we write, for example, ‘p|q.|.p|q’, and instead of ‘~p’, ‘p|p’ (p|q=neither p nor q), then the inner connexion becomes obvious. (The possibility of inference from (x).fx to fa shows that the symbol (x).fx itself has generality in it.)",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.1.3.2 (1/2)",
                "text": "If p follows from q, I can make an inference from q to p, deduce p from q. The nature of the inference can be gathered only from the two propositions. They themselves are the only possible justification of the inference."
              },
              {
                "num": "5.1.3.2 (2/2)",
                "text": "‘Laws of inference’, which are supposed to justify inferences, as in the works of Frege and Russell, have no sense, and would be superfluous.",
                "children": []
              },
              {
                "num": "5.1.3.3",
                "text": "All deductions are made _a priori_.",
                "children": []
              },
              {
                "num": "5.1.3.4",
                "text": "One elementary proposition cannot be deduced form another.",
                "children": []
              },
              {
                "num": "5.1.3.5",
                "text": "There is no possible way of making an inference from the existence of one situation to the existence of another, entirely different situation.",
                "children": []
              },
              {
                "num": "5.1.3.6",
                "text": "There is no causal nexus to justify such an inference.",
                "children": [
                  {
                    "num": "5.1.3.6.1",
                    "text": "We _cannot_ infer the events of the future from those of the present. Belief in the causal nexus is _superstition_.",
                    "children": []
                  },
                  {
                    "num": "5.1.3.6.2 (1/2)",
                    "text": "The freedom of the will consists in the impossibility of knowing actions that still lie in the future. We could know them only if causality were an _inner_ necessity like that of logical inference.—The connexion between knowledge and what is known is that of logical necessity."
                  },
                  {
                    "num": "5.1.3.6.2 (2/2)",
                    "text": "(‘A knows that p is the case’, has no sense if p is a tautology.)",
                    "children": []
                  },
                  {
                    "num": "5.1.3.6.3",
                    "text": "If the truth of a proposition does not _follow_ from the fact that it is self-evident to us, then its self-evidence in no way justifies our belief in its truth.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.1.4",
            "text": "If one proposition follows from another, then the latter says more than the former, and the former less than the latter.",
            "children": [
              {
                "num": "5.1.4.1",
                "text": "If p follows from q and q from p, then they are one and the same proposition.",
                "children": []
              },
              {
                "num": "5.1.4.2",
                "text": "A tautology follows from all propositions: it says nothing.",
                "children": []
              },
              {
                "num": "5.1.4.3 (1/2)",
                "text": "Contradiction is that common factor of propositions which _no_ proposition has in common with another. Tautology is the common factor of all propositions that have nothing in common with one another."
              },
              {
                "num": "5.1.4.3 (2/2)",
                "text": "Contradiction, one might say, vanishes outside all propositions: tautology vanishes inside them. Contradiction is the outer limit of propositions: tautology is the unsubstantial point at their centre.",
                "children": []
              }
            ]
          },
          {
            "num": "5.1.5",
            "text": "If Tr is the number of the truth-grounds of a proposition ‘r’, and if Trs is the number of the truth-grounds of a proposition ‘s’ that are at the same time truth-grounds of ‘r’, then we call the ratio Trs : Tr the degree of probability that the proposition ‘r’ gives to the proposition ‘s’.",
            "children": [
              {
                "num": "5.1.5.1",
                "text": "In a schema like the one above in 5.101, let Tr be the number of ‘T’s’ in the proposition r, and let Trs, be the number of ‘T’s’ in the proposition s that stand in columns in which the proposition r has ‘T’s’. Then the proposition r gives to the proposition s the probability Trs : Tr.",
                "children": [
                  {
                    "num": "5.1.5.1.1",
                    "text": "There is no special object peculiar to probability propositions.",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.1.5.2 (1/2)",
                "text": "When propositions have no truth-arguments in common with one another, we call them independent of one another. Two elementary propositions give one another the probability ½. If p follows from q, then the proposition ‘q’ gives to the proposition ‘p’ the probability 1."
              },
              {
                "num": "5.1.5.2 (2/2)",
                "text": "The certainty of logical inference is a limiting case of probability. (Application of this to tautology and contradiction.)",
                "children": []
              },
              {
                "num": "5.1.5.3",
                "text": "In itself, a proposition is neither probable nor improbable. Either an event occurs or it does not: there is no middle way.",
                "children": []
              },
              {
                "num": "5.1.5.4 (1/5)",
                "text": "Suppose that an urn contains black and white balls in equal numbers (and none of any other kind). I draw one ball after another, putting them back into the urn."
              },
              {
                "num": "5.1.5.4 (2/5)",
                "text": "By this experiment I can establish that the number of black balls drawn and the number of white balls drawn approximate to one another as the draw continues. So _this_ is not a mathematical truth."
              },
              {
                "num": "5.1.5.4 (3/5)",
                "text": "Now, if I say, ‘The probability of my drawing a white ball is equal to the probability of my drawing a black one’,"
              },
              {
                "num": "5.1.5.4 (4/5)",
                "text": "this means that all the circumstances that I know of (including the laws of nature assumed as hypotheses) give no _more_ probability to the occurrence of the one event than to that of the other."
              },
              {
                "num": "5.1.5.4 (5/5)",
                "text": "That is to say, they give each the probability ½, as can easily be gathered from the above definitions. What I confirm by the experiment is that the occurrence of the two events is independent of the circumstances of which I have no more detailed knowledge.",
                "children": []
              },
              {
                "num": "5.1.5.5",
                "text": "The minimal unit for a probability proposition is this: The circumstances—of which I have no further knowledge—give such and such a degree of probability to the occurrence of a particular event.",
                "children": []
              },
              {
                "num": "5.1.5.6 (1/2)",
                "text": "It is in this way that probability is a generalization. It involves a general description of a propositional form. We use probability only in default of certainty—if our knowledge of a fact is not indeed complete, but we do know _something_ about its form."
              },
              {
                "num": "5.1.5.6 (2/2)",
                "text": "(A proposition may well be an incomplete picture of a certain situation, but it is always a complete picture of _something_.) A probability proposition is a sort of excerpt from other propositions.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "5.2",
        "text": "The structures of propositions stand in internal relations to one another.",
        "children": [
          {
            "num": "5.2.1",
            "text": "In order to give prominence to these internal relations we can adopt the following mode of expression: we can represent a proposition as the result of an operation that produces it out of other propositions (which are the bases of the operation).",
            "children": []
          },
          {
            "num": "5.2.2",
            "text": "An operation is the expression of a relation between the structures of its result and of its bases.",
            "children": []
          },
          {
            "num": "5.2.3",
            "text": "The operation is what has to be done to the one proposition in order to make the other out of it.",
            "children": [
              {
                "num": "5.2.3.1",
                "text": "And that will, of course, depend on their formal properties, on the internal similarity of their forms.",
                "children": []
              },
              {
                "num": "5.2.3.2",
                "text": "The internal relation by which a series is ordered is equivalent to the operation that produces one term from another.",
                "children": []
              },
              {
                "num": "5.2.3.3",
                "text": "Operations cannot make their appearance before the point at which one proposition is generated out of another in a logically meaningful way; i.e. the point at which the logical construction of propositions begins.",
                "children": []
              },
              {
                "num": "5.2.3.4",
                "text": "Truth-functions of elementary propositions are results of operations with elementary propositions as bases. (These operations I call truth-operations.)",
                "children": [
                  {
                    "num": "5.2.3.4.1",
                    "text": "The sense of a truth-function of p is a function of the sense of p. Negation, logical addition, logical multiplication, etc. etc. are operations. (Negation reverses the sense of a proposition.)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.2.4",
            "text": "An operation manifests itself in a variable; it shows how we can get from one form of proposition to another. It gives expression to the difference between the forms. (And what the bases of an operation and its result have in common is just the bases themselves.)",
            "children": [
              {
                "num": "5.2.4.1",
                "text": "An operation is not the mark of a form, but only of a difference between forms.",
                "children": []
              },
              {
                "num": "5.2.4.2",
                "text": "The operation that produces ‘q’ from ‘p’ also produces ‘r’ from ‘q’, and so on. There is only one way of expressing this: ‘p’, ‘q’, ‘r’, etc. have to be variables that give expression in a general way to certain formal relations.",
                "children": []
              }
            ]
          },
          {
            "num": "5.2.5",
            "text": "The occurrence of an operation does not characterize the sense of a proposition. Indeed, no statement is made by an operation, but only by its result, and this depends on the bases of the operation. (Operations and functions must not be confused with each other.)",
            "children": [
              {
                "num": "5.2.5.1",
                "text": "A function cannot be its own argument, whereas an operation can take one of its own results as its base.",
                "children": []
              },
              {
                "num": "5.2.5.2",
                "text": "It is only in this way that the step from one term of a series of forms to another is possible (from one type to another in the hierarchies of Russell and Whitehead). (Russell and Whitehead did not admit the possibility of such steps, but repeatedly availed themselves of it.)",
                "children": [
                  {
                    "num": "5.2.5.2.1 (1/2)",
                    "text": "If an operation is applied repeatedly to its own results, I speak of successive applications of it."
                  },
                  {
                    "num": "5.2.5.2.1 (2/2)",
                    "text": "(‘O’O’O’a’ is the result of three successive applications of the operation ‘O’ξ’ to ‘a’.) In a similar sense I speak of successive applications of _more than one_ operation to a number of propositions.",
                    "children": []
                  },
                  {
                    "num": "5.2.5.2.2 (1/2)",
                    "text": "Accordingly I use the sign ‘[a,  x,  O’x]’ for the general term of the series of forms a,  O’a,  O’O’a,…."
                  },
                  {
                    "num": "5.2.5.2.2 (2/2)",
                    "text": "This bracketed expression is a variable: the first term of the bracketed expression is the beginning of the series of forms, the second is the form of a term x arbitrarily selected from the series, and the third is the form of the term that immediately follows x in the series.",
                    "children": []
                  },
                  {
                    "num": "5.2.5.2.3",
                    "text": "The concept of successive applications of an operation is equivalent to the concept ‘and so on’.",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.2.5.3",
                "text": "One operation can counteract the effect of another. Operations can cancel one another.",
                "children": []
              },
              {
                "num": "5.2.5.4",
                "text": "An operation can vanish (e.g. negation in ‘~~p’: ~~p=p).",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "5.3 (1/4)",
        "text": "All propositions are results of truth-operations on elementary propositions. A truth-operation is the way in which a truth-function is produced out of elementary propositions."
      },
      {
        "num": "5.3 (2/4)",
        "text": "It is of the essence of truth-operations that, just as elementary propositions yield a truth-function of themselves, so too in the same way truth-functions yield a further truth-function."
      },
      {
        "num": "5.3 (3/4)",
        "text": "When a truth-operation is applied to truth-functions of elementary propositions, it always generates another truth-function of elementary propositions, another proposition."
      },
      {
        "num": "5.3 (4/4)",
        "text": "When a truth-operation is applied to the results of truth-operations on elementary propositions, there is always a _single_ operation on elementary propositions that has the same result. Every proposition is the result of truth-operations on elementary propositions.",
        "children": [
          {
            "num": "5.3.1",
            "text": "The schemata in 4.31 have a meaning even when ‘p’, ‘q’, ‘r’, etc. are not elementary propositions. And it is easy to see that the propositional sign in 4.442 expresses a single truth-function of elementary propositions even when ‘p’ and ‘q’ are truth-functions of elementary propositions.",
            "children": []
          },
          {
            "num": "5.3.2",
            "text": "All truth-functions are results of successive applications to elementary propositions of a finite number of truth-operations.",
            "children": []
          }
        ]
      },
      {
        "num": "5.4",
        "text": "At this point it becomes manifest that there are no ‘logical objects’ or ‘logical constants’ (in Frege’s and Russell’s sense).",
        "children": [
          {
            "num": "5.4.1",
            "text": "The reason is that the results of truth-operations on truth-functions are always identical whenever they are one and the same truth-function of elementary propositions.",
            "children": []
          },
          {
            "num": "5.4.2 (1/2)",
            "text": "It is self-evident that ∨, ⊃, etc. are not relations in the sense in which right and left etc. are relations. The interdefinability of Frege’s and Russell’s ‘primitive signs’ of logic is enough to show that they are not primitive signs, still less signs for relations."
          },
          {
            "num": "5.4.2 (2/2)",
            "text": "And it is obvious that the ‘⊃’ defined by means of ‘~’ and ‘∨’ is identical with the one that figures with ‘~’ in the definition of ‘∨’; and that the second ‘∨’ is identical with the first one; and so on.",
            "children": []
          },
          {
            "num": "5.4.3 (1/2)",
            "text": "Even at first sight it seems scarcely credible that there should follow from one fact p infinitely many _others_, namely ~~p, ~~~~p, etc. And it is no less remarkable that the infinite number of propositions of logic (mathematics) follow from half a dozen ‘primitive propositions’."
          },
          {
            "num": "5.4.3 (2/2)",
            "text": "But in fact all the propositions of logic say the same thing, to wit nothing.",
            "children": []
          },
          {
            "num": "5.4.4 (1/4)",
            "text": "Truth-functions are not material functions."
          },
          {
            "num": "5.4.4 (2/4)",
            "text": "For example, an affirmation can be produced by double negation: in such a case does it follow that in some sense negation is contained in affirmation? Does ‘~~p’ negate ~p, or does it affirm p—or both?"
          },
          {
            "num": "5.4.4 (3/4)",
            "text": "The proposition ‘~~p’ is not about negation, as if negation were an object: on the other hand, the possibility of negation is already written into affirmation."
          },
          {
            "num": "5.4.4 (4/4)",
            "text": "And if there were an object called ‘~’, it would follow that ‘~~p’ said something different from what ‘p’ said, just because the one proposition would then be about ~ and the other would not.",
            "children": [
              {
                "num": "5.4.4.1",
                "text": "This vanishing of the apparent logical constants also occurs in the case of ‘~(∃x).~fx’, which says the same as ‘(x).fx’, and in the case of ‘(∃x).fx.x=a’, which says the same as ‘fa’.",
                "children": []
              },
              {
                "num": "5.4.4.2",
                "text": "If we are given a proposition, then _with it_ we are also given the results of all truth-operations that have it as their base.",
                "children": []
              }
            ]
          },
          {
            "num": "5.4.5",
            "text": "If there are primitive logical signs, then any logic that fails to show clearly how they are placed relatively to one another and to justify their existence will be incorrect. The construction of logic _out of_ its primitive signs must be made clear.",
            "children": [
              {
                "num": "5.4.5.1 (1/4)",
                "text": "If logic has primitive ideas, they must be independent of one another. If a primitive idea has been introduced, it must have been introduced in all the combinations in which it ever occurs."
              },
              {
                "num": "5.4.5.1 (2/4)",
                "text": "It cannot, therefore, be introduced first for _one_ combination and later reintroduced for another. For example, once negation has been introduced, we must understand it both in propositions of the form ‘~p’ and in propositions like ‘~(p∨q)’, ‘(∃x).~fx’, etc."
              },
              {
                "num": "5.4.5.1 (3/4)",
                "text": "We must not introduce it first for the one class of cases and then for the other, since it would then be left in doubt whether its meaning were the same in both cases, and no reason would have been given for combining the signs in the same way in both cases."
              },
              {
                "num": "5.4.5.1 (4/4)",
                "text": "(In short, Frege’s remarks about introducing signs by means of definitions (in The Fundamental Laws of Arithmetic) also apply, _mutatis mutandis_, to the introduction of primitive signs.)",
                "children": []
              },
              {
                "num": "5.4.5.2 (1/5)",
                "text": "The introduction of any new device into the symbolism of logic is necessarily a momentous event. In logic a new device should not be introduced in brackets or in a footnote with what one might call a completely innocent air."
              },
              {
                "num": "5.4.5.2 (2/5)",
                "text": "(Thus in Russell and Whitehead’s Principia Mathematica there occur definitions and primitive propositions expressed in words."
              },
              {
                "num": "5.4.5.2 (3/5)",
                "text": "Why this sudden appearance of words?"
              },
              {
                "num": "5.4.5.2 (4/5)",
                "text": "It would require a justification, but none is given, or could be given, since the procedure is in fact illicit.)"
              },
              {
                "num": "5.4.5.2 (5/5)",
                "text": "But if the introduction of a new device has proved necessary at a certain point, we must immediately ask ourselves, ‘At what points is the employment of this device now _unavoidable_?’ and its place in logic must be made clear.",
                "children": []
              },
              {
                "num": "5.4.5.3",
                "text": "All numbers in logic stand in need of justification. Or rather, it must become evident that there are no numbers in logic. There are no privileged numbers.",
                "children": []
              },
              {
                "num": "5.4.5.4",
                "text": "In logic there is no co-ordinate status, and there can be no classification. In logic there can be no distinction between the general and the specific.",
                "children": [
                  {
                    "num": "5.4.5.4.1 (1/2)",
                    "text": "The solutions of the problems of logic must be simple, since they set the standard of simplicity. Men have always had a presentiment that there must be a realm in which the answers to questions are symmetrically combined—_a priori_—to form a self-contained system."
                  },
                  {
                    "num": "5.4.5.4.1 (2/2)",
                    "text": "A realm subject to the law: _Simplex sigillum veri_.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.4.6 (1/2)",
            "text": "If we introduced logical signs properly, then we should also have introduced at the same time the sense of all combinations of them; i.e. not only ‘p∨q’ but ‘~(p∨~q)’ as well, etc. etc."
          },
          {
            "num": "5.4.6 (2/2)",
            "text": "We should also have introduced at the same time the effect of all possible combinations of brackets. And thus it would have been made clear that the real general primitive signs are not ‘p∨q’, ‘(∃x).fx’, etc. but the most general form of their combinations.",
            "children": [
              {
                "num": "5.4.6.1 (1/2)",
                "text": "Though it seems unimportant, it is in fact significant that the pseudo-relations of logic, such as ∨ and ⊃, need brackets—unlike real relations. Indeed, the use of brackets with these apparently primitive signs is itself an indication that they are not primitive signs."
              },
              {
                "num": "5.4.6.1 (2/2)",
                "text": "And surely no one is going to believe brackets have an independent meaning.",
                "children": [
                  {
                    "num": "5.4.6.1.1",
                    "text": "Signs for logical operations are punctuation-marks.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.4.7 (1/3)",
            "text": "It is clear that whatever we can say _in advance_ about the form of all propositions, we must be able to say _all at once_. An elementary proposition really contains all logical operations in itself. For ‘fa’ says the same thing as ‘(∃x).fx.x=a’."
          },
          {
            "num": "5.4.7 (2/3)",
            "text": "Wherever there is compositeness, argument and function are present, and where these are present, we already have all the logical constants. One could say that the sole logical constant was what _all_ propositions, by their very nature, had in common with one another."
          },
          {
            "num": "5.4.7 (3/3)",
            "text": "But that is the general propositional form.",
            "children": [
              {
                "num": "5.4.7.1",
                "text": "The general propositional form is the essence of a proposition.",
                "children": [
                  {
                    "num": "5.4.7.1.1",
                    "text": "To give the essence of a proposition means to give the essence of all description, and thus the essence of the world.",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.4.7.2",
                "text": "The description of the most general propositional form is the description of the one and only general primitive sign in logic.",
                "children": []
              },
              {
                "num": "5.4.7.3 (1/2)",
                "text": "Logic must look after itself. If a sign is _possible_, then it is also capable of signifying. Whatever is possible in logic is also permitted. (The reason why ‘Socrates is identical’ means nothing is that there is no property called ‘identical’."
              },
              {
                "num": "5.4.7.3 (2/2)",
                "text": "The proposition is nonsensical because we have failed to make an arbitrary determination, and not because the symbol, in itself, would be illegitimate.) In a certain sense, we cannot make mistakes in logic.",
                "children": [
                  {
                    "num": "5.4.7.3.1",
                    "text": "Self-evidence, which Russell talked about so much, can become dispensable in logic, only because language itself prevents every logical mistake.—What makes logic _a priori_ is the _impossibility_ of illogical thought.",
                    "children": []
                  },
                  {
                    "num": "5.4.7.3.2",
                    "text": "We cannot give a sign the wrong sense.",
                    "children": [
                      {
                        "num": "5.4.7.3.2.1",
                        "text": "Occam’s maxim is, of course, not an arbitrary rule, nor one that is justified by its success in practice: its point is that _unnecessary_ units in a sign-language mean nothing. Signs that serve _one_ purpose are logically equivalent, and signs that serve _none_ are logically meaningless.",
                        "children": []
                      }
                    ]
                  },
                  {
                    "num": "5.4.7.3.3 (1/3)",
                    "text": "Frege says that any legitimately constructed proposition must have a sense. And I say that any possible proposition is legitimately constructed, and, if it has no sense, that can only be because we have failed to give a _meaning_ to some of its constituents."
                  },
                  {
                    "num": "5.4.7.3.3 (2/3)",
                    "text": "(Even if we think that we have done so.) Thus the reason why ‘Socrates is identical’ says nothing is that we have _not_ given any _adjectival_ meaning to the word ‘identical’."
                  },
                  {
                    "num": "5.4.7.3.3 (3/3)",
                    "text": "For when it appears as a sign for identity, it symbolizes in an entirely different way—the signifying relation is a different one—therefore the symbols also are entirely different in the two cases: the two symbols have only the sign in common, and that is an accident.",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.4.7.4",
                "text": "The number of fundamental operations that are necessary depends _solely_ on our notation.",
                "children": []
              },
              {
                "num": "5.4.7.5",
                "text": "All that is required is that we should construct a system of signs with a particular number of dimensions—with a particular mathematical multiplicity.",
                "children": []
              },
              {
                "num": "5.4.7.6",
                "text": "It is clear that this is not a question of a _number of primitive ideas_ that have to be signified, but rather of the expression of a rule.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "5.5",
        "text": "Every truth-function is a result of successive applications to elementary propositions of the operation ‘(-----T)(ξ, . . . . .)’. This operation negates all the propositions in the right-hand pair of brackets, and I call it the negation of those propositions.",
        "children": [
          {
            "num": "5.5.0",
            "text": "",
            "children": [
              {
                "num": "5.5.0.1 (1/5)",
                "text": "When a bracketed expression has propositions as its terms—and the order of the terms inside the brackets is indifferent—then I indicate it by a sign of the form ‘(ξ̅)’."
              },
              {
                "num": "5.5.0.1 (2/5)",
                "text": "‘ξ’ is a variable whose values are terms of the bracketed expression and the bar over the variable indicates that it is the representative of all its values in the brackets. (E.g. if ξ has the three values P, Q, R, then (ξ̅)=(P, Q, R)."
              },
              {
                "num": "5.5.0.1 (3/5)",
                "text": ") What the values of the variable are is something that is stipulated. The stipulation is a description of the propositions that have the variable as their representative.  How the description of the terms of the bracketed expression is produced is not essential."
              },
              {
                "num": "5.5.0.1 (4/5)",
                "text": "We _can_ distinguish three kinds of description: 1. direct enumeration, in which case we can simply substitute for the variable the constants that are its values; 2. giving a function ξ whose values for all values of x are the propositions to be described; 3."
              },
              {
                "num": "5.5.0.1 (5/5)",
                "text": "giving a formal law that governs the construction of the propositions, in which case the bracketed expression has as its members all the terms of a series of forms.",
                "children": []
              },
              {
                "num": "5.5.0.2",
                "text": "So instead of ‘(-----T)(ξ, . . . . .)’, I write ‘N(ξ̅)’. N(ξ̅) is the negation of all the values of the propositional variable ξ.",
                "children": []
              },
              {
                "num": "5.5.0.3",
                "text": "It is obvious that we can easily express how propositions may be constructed with this operation, and how they may not be constructed with it; so it must be possible to find an exact expression for this.",
                "children": []
              }
            ]
          },
          {
            "num": "5.5.1",
            "text": "If ξ has only one value, then N(ξ̅)=~p (not ξ (neither p nor q).",
            "children": [
              {
                "num": "5.5.1.1",
                "text": "How can logic—all-embracing logic, which mirrors the world—use such peculiar crotchets and contrivances? Only because they are all connected with one another in an infinitely fine network, the great mirror.",
                "children": []
              },
              {
                "num": "5.5.1.2 (1/2)",
                "text": "‘~p’ is true if ‘p’ is false. Therefore, in the proposition ‘~p’, when it is true, ‘p’ is a false proposition. How then can the stroke ‘~’ make it agree with reality? But in ‘~p’ it is not ‘~’ that negates, it is rather what is common to all the signs of this notation that negate p."
              },
              {
                "num": "5.5.1.2 (2/2)",
                "text": "That is to say the common rule that governs the construction of ‘~p’, ‘~~~p’, ‘~p∨~p’, ‘~p.~p’, etc. etc. (ad inf.). And this common factor mirrors negation.",
                "children": []
              },
              {
                "num": "5.5.1.3 (1/3)",
                "text": "We might say that what is common to all symbols that affirm both p and q is the proposition ‘p.q’; and that what is common to all symbols that affirm either p or q is the proposition ‘p∨q’."
              },
              {
                "num": "5.5.1.3 (2/3)",
                "text": "And similarly we can say that two propositions are opposed to one another if they have nothing in common with one another, and that every proposition has only one negative, since there is only one proposition that lies completely outside it."
              },
              {
                "num": "5.5.1.3 (3/3)",
                "text": "Thus in Russell’s notation too it is manifest that ‘q:p∨~p’ says the same thing as ‘q’, that ‘p∨~p’ says nothing.",
                "children": []
              },
              {
                "num": "5.5.1.4 (1/2)",
                "text": "Once a notation has been established, there will be in it a rule governing the construction of all propositions that negate p, a rule governing the construction of all propositions that affirm p, and a rule governing the construction of all propositions that affirm p or <q;"
              },
              {
                "num": "5.5.1.4 (2/2)",
                "text": "and so on. These rules are equivalent to the symbols; and in them their sense is mirrored.",
                "children": []
              },
              {
                "num": "5.5.1.5 (1/2)",
                "text": "It must be manifest in our symbols that it can only be propositions that are combined with one another by ‘∨’, ‘~’, etc. And this is indeed the case, since the symbol in ‘p’ and ‘q’ itself presupposes ‘∨’, ‘~’, etc."
              },
              {
                "num": "5.5.1.5 (2/2)",
                "text": "If the sign ‘p’ in ‘p∨q’ does not stand for a complex sign, then it cannot have sense by itself: but in that case the signs ‘p∨p’, ‘p.p’, etc., which have the same sense as p, must also lack sense. But if ‘p∨p’ has no sense, then ‘p∨q’ cannot have a sense either.",
                "children": [
                  {
                    "num": "5.5.1.5.1 (1/3)",
                    "text": "Must the sign of a negative proposition be constructed with that of the positive proposition? Why should it not be possible to express a negative proposition by means of a negative fact? (E.g."
                  },
                  {
                    "num": "5.5.1.5.1 (2/3)",
                    "text": "suppose that ‘a’ does not stand in a certain relation to ‘b’; then this might be used to say that aRb was not the case.) But really even in this case the negative proposition is constructed by an indirect use of the positive."
                  },
                  {
                    "num": "5.5.1.5.1 (3/3)",
                    "text": "The positive _proposition_ necessarily presupposes the existence of the negative _proposition_ and _vice versa_.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.5.2",
            "text": "If ξ has as its values all the values of a function fx for all values of x, then N(ξ̅)=~(∃x).fx.",
            "children": [
              {
                "num": "5.5.2.1",
                "text": "I dissociate the concept _all_ from truth-functions. Frege and Russell introduced generality in association with logical product or logical sum. This made it difficult to understand the propositions ‘(∃x).fx’ and ‘(x).fx’, in which both ideas are embedded.",
                "children": []
              },
              {
                "num": "5.5.2.2",
                "text": "What is peculiar to the generality-sign is first, that it indicates a logical prototype, and secondly, that it gives prominence to constants.",
                "children": []
              },
              {
                "num": "5.5.2.3",
                "text": "The generality-sign occurs as an argument.",
                "children": []
              },
              {
                "num": "5.5.2.4",
                "text": "If objects are given, then at the same time we are given _all_ objects. If elementary propositions are given, then at the same time _all_ elementary propositions are given.",
                "children": []
              },
              {
                "num": "5.5.2.5 (1/2)",
                "text": "It is incorrect to render the proposition ‘(∃x).fx’ in the words, ‘fx is _possible_’ as Russell does."
              },
              {
                "num": "5.5.2.5 (2/2)",
                "text": "The certainty, possibility, or impossibility of a situation is not expressed by a proposition, but by an expression’s being a tautology, a proposition with a sense, or a contradiction. The precedent to which we are constantly inclined to appeal must reside in the symbol itself.",
                "children": []
              },
              {
                "num": "5.5.2.6 (1/2)",
                "text": "We can describe the world completely by means of fully generalized propositions, i.e. without first correlating any name with a particular object."
              },
              {
                "num": "5.5.2.6 (2/2)",
                "text": "Then, in order to arrive at the customary mode of expression, we simply need to add, after an expression like, ‘There is one and only one x such that …’, the words, ‘and that x is a’.",
                "children": [
                  {
                    "num": "5.5.2.6.1 (1/2)",
                    "text": "A fully generalized proposition, like every other proposition, is composite. (This is shown by the fact that in ‘(∃x, ϕ).ϕx’ we have to mention ‘ϕ’ and ‘x’ separately."
                  },
                  {
                    "num": "5.5.2.6.1 (2/2)",
                    "text": "They both, independently, stand in signifying relations to the world, just as is the case in ungeneralized propositions.) It is a mark of a composite symbol that it has something in common with _other_ symbols.",
                    "children": []
                  },
                  {
                    "num": "5.5.2.6.2 (1/2)",
                    "text": "The truth or falsity of _every_ proposition does make some alteration in the general construction of the world. And the range that the totality of elementary propositions leaves open for its construction is exactly the same as that which is delimited by entirely general propositions."
                  },
                  {
                    "num": "5.5.2.6.2 (2/2)",
                    "text": "(If an elementary proposition is true, that means, at any rate, one _more_ true elementary proposition.)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.5.3",
            "text": "Identity of object I express by identity of sign, and not by using a sign for identity. Difference of objects I express by difference of signs.",
            "children": [
              {
                "num": "5.5.3.0",
                "text": "",
                "children": [
                  {
                    "num": "5.5.3.0.1 (1/3)",
                    "text": "It is self-evident that identity is not a relation between objects. This becomes very clear if one considers, for example, the proposition ‘(x):fx.⊃.x=a’."
                  },
                  {
                    "num": "5.5.3.0.1 (2/3)",
                    "text": "What this proposition says is simply that _only_ a satisfies the function f, and not that only things that have a certain relation to a satisfy the function f."
                  },
                  {
                    "num": "5.5.3.0.1 (3/3)",
                    "text": "Of course, it might then be said that _only_ a did have this relation to a; but in order to express that, we should need the identity-sign itself.",
                    "children": []
                  },
                  {
                    "num": "5.5.3.0.2",
                    "text": "Russell’s definition of ‘=’ is inadequate, because according to it we cannot say that two objects have all their properties in common. (Even if this proposition is never correct, it still has _sense_.)",
                    "children": []
                  },
                  {
                    "num": "5.5.3.0.3",
                    "text": "Roughly speaking, to say of _two_ things that they are identical is nonsense, and to say of _one_ thing that it is identical with itself is to say nothing at all.",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.5.3.1",
                "text": "Thus I do not write ‘f(a,b).a=b’, but ‘f(a,a)’ (or ‘f(b,b)’); and not ‘f(a,b).~a=b’, but ‘f(a,b)’.",
                "children": []
              },
              {
                "num": "5.5.3.2",
                "text": "And analogously I do not write ‘(∃x,y).f(x,y).x=y’, but ‘(∃x).f(x,x)’; and not ‘(∃x,y).f(x,y).~x=y’, but ‘(∃x,y).f(x,y)’. (So Russell’s ‘(∃x,y).f(x,y)’ becomes ‘(∃x,y).f(x,y).∨.(∃x).f(x,x)’.)",
                "children": [
                  {
                    "num": "5.5.3.2.1",
                    "text": "Thus, for example, instead of ‘(x):fx ⊃x=a’ we write ‘(∃x).fx.⊃.fa:~(∃x,y).fx.fy’. And the proposition, ‘_Only one_ x satisfies f( )’, will read ‘(∃x).fx.⊃.fa:~(∃x,y).fx.fy’.",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.5.3.3",
                "text": "The identity-sign, therefore, is not an essential constituent of conceptual notation.",
                "children": []
              },
              {
                "num": "5.5.3.4",
                "text": "And now we see that in a correct conceptual notation pseudo-propositions like ‘a=a’, ‘a=b.b=c.⊃a=c’, ‘(x).x=x’, ‘(∃x).x=a’, etc. cannot even be written down.",
                "children": []
              },
              {
                "num": "5.5.3.5 (1/2)",
                "text": "This also disposes of all the problems that were connected with such pseudo-propositions. All the problems that Russell’s ‘axiom of infinity’ brings with it can be solved at this point."
              },
              {
                "num": "5.5.3.5 (2/2)",
                "text": "What the axiom of infinity is intended to say would express itself in language through the existence of infinitely many names with different meanings.",
                "children": [
                  {
                    "num": "5.5.3.5.1 (1/4)",
                    "text": "There are certain cases in which one is tempted to use expressions of the form ‘a=a’ or ‘p⊃p’ and the like. In fact, this happens when one wants to talk about prototypes, e.g. about proposition, thing, etc."
                  },
                  {
                    "num": "5.5.3.5.1 (2/4)",
                    "text": "Thus in Russell’s Principles of Mathematics ‘p is a proposition’—which is nonsense—was given the symbolic rendering ‘p⊃p’ and placed as an hypothesis in front of certain propositions in order to exclude from their argument-places everything but propositions."
                  },
                  {
                    "num": "5.5.3.5.1 (3/4)",
                    "text": "(It is nonsense to place the hypothesis ‘p⊃p’ in front of a proposition, in order to ensure that its arguments shall have the right form, if only because with a non-proposition as argument the hypothesis becomes not false but nonsensical,"
                  },
                  {
                    "num": "5.5.3.5.1 (4/4)",
                    "text": "and because arguments of the wrong kind make the proposition itself nonsensical, so that it preserves itself from wrong arguments just as well, or as badly, as the hypothesis without sense that was appended for that purpose.)",
                    "children": []
                  },
                  {
                    "num": "5.5.3.5.2",
                    "text": "In the same way people have wanted to express, ‘There are no _things_’, by writing ‘~(∃x).x=x’. But even if this were a proposition, would it not be equally true if in fact ‘there were things’ but they were not identical with themselves?",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.5.4",
            "text": "In the general propositional form propositions occur in other propositions only as bases of truth-operations.",
            "children": [
              {
                "num": "5.5.4.1 (1/2)",
                "text": "At first sight it looks as if it were also possible for one proposition to occur in another in a different way. Particularly with certain forms of proposition in psychology, such as ‘A believes that p is the case’ and A has the thought p’, etc."
              },
              {
                "num": "5.5.4.1 (2/2)",
                "text": "For if these are considered superficially, it looks as if the proposition p stood in some kind of relation to an object A. (And in modern theory of knowledge (Russell, Moore, etc.) these propositions have actually been construed in this way.)",
                "children": []
              },
              {
                "num": "5.5.4.2",
                "text": "It is clear, however, that ‘A believes that p’, ‘A has the thought p’, and ‘A says p’ are of the form ‘“p” says p’: and this does not involve a correlation of a fact with an object, but rather the correlation of facts by means of the correlation of their objects.",
                "children": [
                  {
                    "num": "5.5.4.2.1",
                    "text": "This shows too that there is no such thing as the soul—the subject, etc.—as it is conceived in the superficial psychology of the present day. Indeed a composite soul would no longer be a soul.",
                    "children": []
                  },
                  {
                    "num": "5.5.4.2.2",
                    "text": "The correct explanation of the form of the proposition, ‘A makes the judgement p’, must show that it is impossible for a judgement to be a piece of nonsense. (Russell’s theory does not satisfy this requirement.)",
                    "children": []
                  },
                  {
                    "num": "5.5.4.2.3 (1/2)",
                    "text": "To perceive a complex means to perceive that its constituents are related to one another in such and such a way."
                  },
                  {
                    "num": "5.5.4.2.3 (2/2)",
                    "text": "This no doubt also explains why there are two possible ways of seeing the figure [IMAGE-55423]  (If I look in the first place at the corners marked a and only glance at the b’s, then the a’s appear to be in front, and _vice versa_).",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "5.5.5 (1/2)",
            "text": "We now have to answer a priori the question about all the possible forms of elementary propositions. Elementary propositions consist of names."
          },
          {
            "num": "5.5.5 (2/2)",
            "text": "Since, however, we are unable to give the number of names with different meanings, we are also unable to give the composition of elementary propositions.",
            "children": [
              {
                "num": "5.5.5.1",
                "text": "Our fundamental principle is that whenever a question can be decided by logic at all it must be possible to decide it without more ado. (And if we get into a position where we have to look at the world for an answer to such a problem, that shows that we are on a completely wrong track.)",
                "children": []
              },
              {
                "num": "5.5.5.2 (1/2)",
                "text": "The ‘experience’ that we need in order to understand logic is not that something or other is the state of things, but that something _is_: that, however, is _not_ an experience. Logic is _prior_ to every experience—that something _is so_."
              },
              {
                "num": "5.5.5.2 (2/2)",
                "text": "It is prior to the question ‘How?’, not prior to the question ‘What?’",
                "children": [
                  {
                    "num": "5.5.5.2.1",
                    "text": "And if this were not so, how could we apply logic? We might put it in this way: if there would be a logic even if there were no world, how then could there be a logic given that there is a world?",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.5.5.3",
                "text": "Russell said that there were simple relations between different numbers of things (individuals). But between what numbers? And how is this supposed to be decided?—By experience? (There is no privileged number.)",
                "children": []
              },
              {
                "num": "5.5.5.4",
                "text": "It would be completely arbitrary to give any specific form.",
                "children": [
                  {
                    "num": "5.5.5.4.1",
                    "text": "It is supposed to be possible to answer _a priori_ the question whether I can get into a position in which I need the sign for a 27-termed relation in order to signify something.",
                    "children": []
                  },
                  {
                    "num": "5.5.5.4.2",
                    "text": "But is it really legitimate even to ask such a question? Can we set up a form of sign without knowing whether anything can correspond to it? Does it make sense to ask what there must _be_ in order that something can be the case?",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.5.5.5 (1/2)",
                "text": "Clearly we have some concept of elementary propositions quite apart from their particular logical forms.  But when there is a system by which we can create symbols, the system is what is important for logic and not the individual symbols."
              },
              {
                "num": "5.5.5.5 (2/2)",
                "text": "And anyway, is it really possible that in logic I should have to deal with forms that I can invent? What I have to deal with must be that which makes it possible for me to invent them.",
                "children": []
              },
              {
                "num": "5.5.5.6",
                "text": "There cannot be a hierarchy of the forms of elementary propositions. We can foresee only what we ourselves construct.",
                "children": [
                  {
                    "num": "5.5.5.6.1",
                    "text": "Empirical reality is limited by the totality of objects. The limit also makes itself manifest in the totality of elementary propositions. Hierarchies are and must be independent of reality.",
                    "children": []
                  },
                  {
                    "num": "5.5.5.6.2",
                    "text": "If we know on purely logical grounds that there must be elementary propositions, then everyone who understands propositions in their unanalyzed form must know it.",
                    "children": []
                  },
                  {
                    "num": "5.5.5.6.3 (1/2)",
                    "text": "In fact, all the propositions of our everyday language, just as they stand, are in perfect logical order.—That utterly simple thing, which we have to formulate here, is not an image of the truth, but the truth itself in its entirety."
                  },
                  {
                    "num": "5.5.5.6.3 (2/2)",
                    "text": "(Our problems are not abstract, but perhaps the most concrete that there are.)",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.5.5.7 (1/2)",
                "text": "The _application_ of logic decides what elementary propositions there are. What belongs to its application, logic cannot anticipate. It is clear that logic must not clash with its application. But logic has to be in contact with its application."
              },
              {
                "num": "5.5.5.7 (2/2)",
                "text": "Therefore logic and its application must not overlap.",
                "children": [
                  {
                    "num": "5.5.5.7.1",
                    "text": "If I cannot say _a priori_ what elementary propositions there are, then the attempt to do so must lead to obvious nonsense.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "num": "5.6",
        "text": "_The limits of my language_ mean the limits of my world.",
        "children": [
          {
            "num": "5.6.1 (1/3)",
            "text": "Logic pervades the world: the limits of the world are also its limits."
          },
          {
            "num": "5.6.1 (2/3)",
            "text": "So we cannot say in logic, ‘The world has this in it, and this, but not that.’ For that would appear to presuppose that we were excluding certain possibilities, and this cannot be the case, since it would require that logic should go beyond the limits of the world;"
          },
          {
            "num": "5.6.1 (3/3)",
            "text": "for only in that way could it view those limits from the other side as well. We cannot think what we cannot think; so what we cannot think we cannot _say_ either.",
            "children": []
          },
          {
            "num": "5.6.2 (1/2)",
            "text": "This remark provides the key to the problem, how much truth there is in solipsism. For what the solipsist _means_ is quite correct; only it cannot be _said_, but makes itself manifest."
          },
          {
            "num": "5.6.2 (2/2)",
            "text": "The world is _my_ world: this is manifest in the fact that the limits of _language_ (of that language which alone I understand) mean the limits of _my_ world.",
            "children": [
              {
                "num": "5.6.2.1",
                "text": "The world and life are one.",
                "children": []
              }
            ]
          },
          {
            "num": "5.6.3",
            "text": "I am my world. (The microcosm.)",
            "children": [
              {
                "num": "5.6.3.1 (1/3)",
                "text": "There is no such thing as the subject that thinks or entertains ideas."
              },
              {
                "num": "5.6.3.1 (2/3)",
                "text": "If I wrote a book called _The World as I found it_, I should have to include a report on my body, and should have to say which parts were subordinate to my will, and which were not, etc., this being a method of isolating the subject,"
              },
              {
                "num": "5.6.3.1 (3/3)",
                "text": "or rather of showing that in an important sense there is no subject; for it alone could _not_ be mentioned in that book.—",
                "children": []
              },
              {
                "num": "5.6.3.2",
                "text": "The subject does not belong to the world: rather, it is a limit of the world.",
                "children": []
              },
              {
                "num": "5.6.3.3",
                "text": "Where _in_ the world is a metaphysical subject to be found? You will say that this is exactly like the case of the eye and the visual field. But really you do _not_ see the eye. And nothing _in the visual field_ allows you to infer that it is seen by an eye.",
                "children": [
                  {
                    "num": "5.6.3.3.1",
                    "text": "For the form of the visual field is surely not like this Eye —[IMAGE-56331]",
                    "children": []
                  }
                ]
              },
              {
                "num": "5.6.3.4",
                "text": "This is connected with the fact that no part of our experience is at the same time a priori. Whatever we see could be other than it is. Whatever we can describe at all could be other than it is. There is no a priori order of things.",
                "children": []
              }
            ]
          },
          {
            "num": "5.6.4",
            "text": "Here it can be seen that solipsism, when its implications are followed out strictly, coincides with pure realism. The self of solipsism shrinks to a point without extension, and there remains the reality co-ordinated with it.",
            "children": [
              {
                "num": "5.6.4.1 (1/2)",
                "text": "Thus there really is a sense in which philosophy can talk about the self in a non-psychological way. What brings the self into philosophy is the fact that ‘the world is my world’."
              },
              {
                "num": "5.6.4.1 (2/2)",
                "text": "The philosophical self is not the human being, not the human body, or the human soul, with which psychology deals, but rather the metaphysical subject, the limit of the world—not a part of it.",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "num": "6",
    "text": "The general form of a truth-function is  [p,  ξ̅,  N(ξ̅)]. This is the general form of a proposition.",
    "children": [
      {
        "num": "6.0",
        "text": "",
        "children": [
          {
            "num": "6.0.0",
            "text": "",
            "children": [
              {
                "num": "6.0.0.1",
                "text": "What this says is just that every proposition is a result of successive applications to elementary propositions of the operation N(ξ̅).",
                "children": []
              },
              {
                "num": "6.0.0.2",
                "text": "If we are given the general form according to which propositions are constructed, then with it we are also given the general form according to which one proposition can be generated out of another by means of an operation.",
                "children": []
              }
            ]
          },
          {
            "num": "6.0.1",
            "text": "Therefore the general form of an operation Ω’(η) is [ξ̅,  N(ξ̅)]’(η) (=[η, ξ̅,  N(ξ̅)]). This is the most general form of transition from one proposition to another.",
            "children": []
          },
          {
            "num": "6.0.2 (1/3)",
            "text": "And _this_ is how we arrive at numbers."
          },
          {
            "num": "6.0.2 (2/3)",
            "text": "I give the following definitions [IMAGE-602]  So, in accordance with these rules, which deal with signs, we write the series x,  Ω’x,  Ω’Ω’x,  Ω’Ω’Ω’x,… in the following way Ω0’x,  Ω0+1’x,  Ω0+1+1’x,  Ω0+1+1+1’x,… Therefore, instead of ‘[x,  ξ,  Ω’ξ]’, I write  ‘[Ω0’x,  Ων’x,"
          },
          {
            "num": "6.0.2 (3/3)",
            "text": "Ων+1’x]’. And I give the following definitions 0+1=1  Def.,0+1+1=2  Def.,0+1+1+1=3  Def.,(and so on).",
            "children": [
              {
                "num": "6.0.2.1",
                "text": "A number is the exponent of an operation.",
                "children": []
              },
              {
                "num": "6.0.2.2",
                "text": "The concept of number is simply what is common to all numbers, the general form of a number. The concept of number is the variable number. And the concept of numerical equality is the general form of all particular cases of numerical equality.",
                "children": []
              }
            ]
          },
          {
            "num": "6.0.3",
            "text": "The general form of an integer is [0, ξ, ξ+1].",
            "children": [
              {
                "num": "6.0.3.1",
                "text": "The theory of classes is completely superfluous in mathematics. This is connected with the fact that the generality required in mathematics is not _accidental_ generality.",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "6.1",
        "text": "The propositions of logic are tautologies.",
        "children": [
          {
            "num": "6.1.1",
            "text": "Therefore the propositions of logic say nothing. (They are the analytic propositions.)",
            "children": [
              {
                "num": "6.1.1.1 (1/4)",
                "text": "All theories that make a proposition of logic appear to have content are false."
              },
              {
                "num": "6.1.1.1 (2/4)",
                "text": "One might think, for example, that the words ‘true’ and ‘false’ signified two properties among other properties, and then it would seem to be a remarkable fact that every proposition possessed one of these properties."
              },
              {
                "num": "6.1.1.1 (3/4)",
                "text": "On this theory it seems to be anything but obvious, just as, for instance, the proposition, ‘All roses are either yellow or red’, would not sound obvious even if it were true."
              },
              {
                "num": "6.1.1.1 (4/4)",
                "text": "Indeed, the logical proposition acquires all the characteristics of a proposition of natural science and this is the sure sign that it has been construed wrongly.",
                "children": []
              },
              {
                "num": "6.1.1.2",
                "text": "The correct explanation of the propositions of logic must assign to them a unique status among all propositions.",
                "children": []
              },
              {
                "num": "6.1.1.3 (1/2)",
                "text": "It is the peculiar mark of logical propositions that one can recognize that they are true from the symbol alone, and this fact contains in itself the whole philosophy of logic."
              },
              {
                "num": "6.1.1.3 (2/2)",
                "text": "And so too it is a very important fact that the truth or falsity of non-logical propositions _cannot_ be recognized from the propositions alone.",
                "children": []
              }
            ]
          },
          {
            "num": "6.1.2 (1/2)",
            "text": "The fact that the propositions of logic are tautologies _shows_ the formal—logical—properties of language and the world. The fact that a tautology is yielded by _this particular way_ of connecting its constituents characterizes the logic of its constituents."
          },
          {
            "num": "6.1.2 (2/2)",
            "text": "If propositions are to yield a tautology when they are connected in a certain way, they must have certain structural properties. So their yielding a tautology when combined _in this way_ shows that they possess these structural properties.",
            "children": [
              {
                "num": "6.1.2.0",
                "text": "",
                "children": [
                  {
                    "num": "6.1.2.0.1 (1/2)",
                    "text": "For example, the fact that the propositions ‘p’ and ‘~p’ in the combination ‘~(p.~p)’ yield a tautology shows that they contradict one another."
                  },
                  {
                    "num": "6.1.2.0.1 (2/2)",
                    "text": "The fact that the propositions ‘p⊃q’, ‘p’, and ‘q’, combined with one another in the form ‘(p⊃q).(p):⊃:(q)’, yield a tautology shows that q follows from p and p⊃q. The fact that ‘(x).fx:⊃:fa’ is a tautology shows that fa follows from (x).fx. Etc. etc.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.0.2",
                    "text": "It is clear that one could achieve the same purpose by using contradictions instead of tautologies.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.0.3 (1/5)",
                    "text": "In order to recognize an expression as a tautology, in cases where no generality-sign occurs in it, one can employ the following intuitive method: instead of ‘p’, ‘q’, ‘r’, etc. I write ‘TpF’, ‘TqF’, ‘TrF’, etc. Truth-combinations I express by means of brackets, e.g."
                  },
                  {
                    "num": "6.1.2.0.3 (2/5)",
                    "text": "[IMAGE-61203-a] and I use lines to express the correlation of the truth or falsity of the whole proposition with the truth-combinations of its truth-arguments, in the following way [IMAGE-61203-b] So this sign, for instance, would represent the proposition p⊃q."
                  },
                  {
                    "num": "6.1.2.0.3 (3/5)",
                    "text": "Now, by way of example, I wish to examine the proposition ~(p.~p) (the law of contradiction) in order to determine whether it is a tautology."
                  },
                  {
                    "num": "6.1.2.0.3 (4/5)",
                    "text": "In our notation the form ‘~ξ’ is written as  [IMAGE-61203-c] and the form ‘ξ.η’ as [IMAGE-61203-d] Hence the proposition ~(p.~q) reads as follows [IMAGE-61203-e] If we here substitute ‘p’ for ‘q’ and examine how the outermost T and F are connected with the innermost ones,"
                  },
                  {
                    "num": "6.1.2.0.3 (5/5)",
                    "text": "the result will be that the truth of the whole proposition is correlated with all the truth-combinations of its argument, and its falsity with none of the truth-combinations.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.1.2.1 (1/2)",
                "text": "The propositions of logic demonstrate the logical properties of propositions by combining them so as to form propositions that say nothing. This method could also be called a zero-method."
              },
              {
                "num": "6.1.2.1 (2/2)",
                "text": "In a logical proposition, propositions are brought into equilibrium with one another, and the state of equilibrium then indicates what the logical constitution of these propositions must be.",
                "children": []
              },
              {
                "num": "6.1.2.2",
                "text": "It follows from this that we can actually do without logical propositions; for in a suitable notation we can in fact recognize the formal properties of propositions by mere inspection of the propositions themselves.",
                "children": [
                  {
                    "num": "6.1.2.2.1 (1/2)",
                    "text": "If, for example, two propositions ‘p’ and ‘q’ in the combination ‘p⊃q’ yield a tautology, then it is clear that q follows from p."
                  },
                  {
                    "num": "6.1.2.2.1 (2/2)",
                    "text": "For example, we see from the two propositions themselves that ‘q’ follows from ‘p⊃q.p’, but it is also possible to show it in _this_ way: we combine them to form ‘p⊃q.p:⊃:q’, and then show that this is a tautology.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.2.2",
                    "text": "This throws some light on the question why logical propositions cannot be confirmed by experience any more than they can be refuted by it. Not only must a proposition of logic be irrefutable by any possible experience, but it must also be unconfirmable by any possible experience.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.2.3",
                    "text": "Now it becomes clear why people have often felt as if it were for us to ‘_postulate_’ the ‘truths of logic’. The reason is that we can postulate them in so far as we can postulate an adequate notation.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.2.4",
                    "text": "It also becomes clear now why logic was called the theory of forms and of inference.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.1.2.3",
                "text": "Clearly the laws of logic cannot in their turn be subject to laws of logic. (There is not, as Russell thought, a special law of contradiction for each ‘type’; one law is enough, since it is not applied to itself.)",
                "children": [
                  {
                    "num": "6.1.2.3.1",
                    "text": "The mark of a logical proposition is _not_ general validity. To be general means no more than to be accidentally valid for all things. An ungeneralized proposition can be tautological just as well as a generalized one.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.3.2 (1/2)",
                    "text": "The general validity of logic might be called essential, in contrast with the accidental general validity of such propositions as ‘All men are mortal’."
                  },
                  {
                    "num": "6.1.2.3.2 (2/2)",
                    "text": "Propositions like Russell’s ‘axiom of reducibility’ are not logical propositions, and this explains our feeling that, even if they were true, their truth could only be the result of a fortunate accident.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.3.3",
                    "text": "It is possible to imagine a world in which the axiom of reducibility is not valid. It is clear, however, that logic has nothing to do with the question whether our world really is like that or not.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.1.2.4 (1/5)",
                "text": "The propositions of logic describe the scaffolding of the world, or rather they represent it. They have no ‘subject-matter’. They presuppose that names have meaning and elementary propositions sense; and that is their connexion with the world."
              },
              {
                "num": "6.1.2.4 (2/5)",
                "text": "It is clear that something about the world must be indicated by the fact that certain combinations of symbols—whose essence involves the possession of a determinate character—are tautologies. This contains the decisive point."
              },
              {
                "num": "6.1.2.4 (3/5)",
                "text": "We have said that some things are arbitrary in the symbols that we use and that some things are not."
              },
              {
                "num": "6.1.2.4 (4/5)",
                "text": "In logic it is only the latter that express: but that means that logic is not a field in which _we_ express what we wish with the help of signs, but rather one in which the nature of the natural and inevitable signs speaks for itself."
              },
              {
                "num": "6.1.2.4 (5/5)",
                "text": "If we know the logical syntax of any sign-language, then we have already been given all the propositions of logic.",
                "children": []
              },
              {
                "num": "6.1.2.5",
                "text": "It is possible—indeed possible even according to the old conception of logic—to give in advance a description of all ‘true’ logical propositions.",
                "children": [
                  {
                    "num": "6.1.2.5.1",
                    "text": "Hence there can _never_ be surprises in logic.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.1.2.6 (1/4)",
                "text": "One can calculate whether a proposition belongs to logic, by calculating the logical properties of the _symbol_. And this is what we do when we ‘prove’ a logical proposition."
              },
              {
                "num": "6.1.2.6 (2/4)",
                "text": "For, without bothering about sense or meaning, we construct the logical proposition out of others using only _rules that deal with signs_."
              },
              {
                "num": "6.1.2.6 (3/4)",
                "text": "The proof of logical propositions consists in the following process: we produce them out of other logical propositions by successively applying certain operations that always generate further tautologies out of the initial ones."
              },
              {
                "num": "6.1.2.6 (4/4)",
                "text": "(And in fact only tautologies _follow_ from a tautology.) Of course this way of showing that the propositions of logic are tautologies is not at all essential to logic, if only because the propositions from which the proof starts must show without any proof that they are tautologies.",
                "children": [
                  {
                    "num": "6.1.2.6.1",
                    "text": "In logic process and result are equivalent. (Hence the absence of surprise.)",
                    "children": []
                  },
                  {
                    "num": "6.1.2.6.2",
                    "text": "Proof in logic is merely a mechanical expedient to facilitate the recognition of tautologies in complicated cases.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.6.3 (1/2)",
                    "text": "Indeed, it would be altogether too remarkable if a proposition that had sense could be proved _logically_ from others, and _so too_ could a logical proposition."
                  },
                  {
                    "num": "6.1.2.6.3 (2/2)",
                    "text": "It is clear from the start that a logical proof of a proposition that has sense and a proof _in_ logic must be two entirely different things.",
                    "children": []
                  },
                  {
                    "num": "6.1.2.6.4",
                    "text": "A proposition that has sense states something, which is shown by its proof to be so. In logic every proposition is the form of a proof. Every proposition of logic is a _modus ponens_ represented in signs. (And one cannot express the _modus ponens_ by means of a proposition.)",
                    "children": []
                  },
                  {
                    "num": "6.1.2.6.5",
                    "text": "It is always possible to construe logic in such a way that every proposition is its own proof.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.1.2.7",
                "text": "All the propositions of logic are of equal status: it is not the case that some of them are essentially derived propositions. Every tautology itself shows that it is a tautology.",
                "children": [
                  {
                    "num": "6.1.2.7.1 (1/2)",
                    "text": "It is clear that the number of the ‘primitive propositions of logic’ is arbitrary, since one could derive logic from a single primitive proposition, e.g. by simply constructing the logical product of Frege’s primitive propositions."
                  },
                  {
                    "num": "6.1.2.7.1 (2/2)",
                    "text": "(Frege would perhaps say that we should then no longer have an immediately self-evident primitive proposition. But it is remarkable that a thinker as rigorous as Frege appealed to the degree of self-evidence as the criterion of a logical proposition.)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "6.1.3",
            "text": "Logic is not a body of doctrine, but a mirror-image of the world. Logic is transcendental.",
            "children": []
          }
        ]
      },
      {
        "num": "6.2",
        "text": "Mathematics is a logical method. The propositions of mathematics are equations, and therefore pseudo-propositions.",
        "children": [
          {
            "num": "6.2.1",
            "text": "A proposition of mathematics does not express a thought.",
            "children": [
              {
                "num": "6.2.1.1 (1/2)",
                "text": "Indeed in real life a mathematical proposition is never what we want. Rather, we make use of mathematical propositions _only_ in inferences from propositions that do not belong to mathematics to others that likewise do not belong to mathematics."
              },
              {
                "num": "6.2.1.1 (2/2)",
                "text": "(In philosophy the question, ‘What do we actually use this word or this proposition for?’ repeatedly leads to valuable insights.)",
                "children": []
              }
            ]
          },
          {
            "num": "6.2.2",
            "text": "The logic of the world, which is shown in tautologies by the propositions of logic, is shown in equations by mathematics.",
            "children": []
          },
          {
            "num": "6.2.3 (1/2)",
            "text": "If two expressions are combined by means of the sign of equality, that means that they can be substituted for one another. But it must be manifest in the two expressions themselves whether this is the case or not."
          },
          {
            "num": "6.2.3 (2/2)",
            "text": "When two expressions can be substituted for one another, that characterizes their logical form.",
            "children": [
              {
                "num": "6.2.3.1",
                "text": "It is a property of affirmation that it can be construed as double negation. It is a property of ‘1+1+1+1’ that it can be construed as ‘(1+1)+(1+1)’.",
                "children": []
              },
              {
                "num": "6.2.3.2 (1/2)",
                "text": "Frege says that the two expressions have the same meaning but different senses."
              },
              {
                "num": "6.2.3.2 (2/2)",
                "text": "But the essential point about an equation is that it is not necessary in order to show that the two expressions connected by the sign of equality have the same meaning, since this can be seen from the two expressions themselves.",
                "children": [
                  {
                    "num": "6.2.3.2.1",
                    "text": "And the possibility of proving the propositions of mathematics means simply that their correctness can be perceived without its being necessary that what they express should itself be compared with the facts in order to determine its correctness.",
                    "children": []
                  },
                  {
                    "num": "6.2.3.2.2",
                    "text": "It is impossible to _assert_ the identity of meaning of two expressions. For in order to be able to assert anything about their meaning, I must know their meaning, and I cannot know their meaning without knowing whether what they mean is the same or different.",
                    "children": []
                  },
                  {
                    "num": "6.2.3.2.3",
                    "text": "An equation merely marks the point of view from which I consider the two expressions: it marks their equivalence in meaning.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.2.3.3",
                "text": "The question whether intuition is needed for the solution of mathematical problems must be given the answer that in this case language itself provides the necessary intuition.",
                "children": [
                  {
                    "num": "6.2.3.3.1",
                    "text": "The process of _calculating_ serves to bring about that intuition. Calculation is not an experiment.",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.2.3.4",
                "text": "Mathematics is a method of logic.",
                "children": [
                  {
                    "num": "6.2.3.4.1",
                    "text": "It is the essential characteristic of mathematical method that it employs equations. For it is because of this method that every proposition of mathematics must go without saying.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "6.2.4 (1/2)",
            "text": "The method by which mathematics arrives at its equations is the method of substitution."
          },
          {
            "num": "6.2.4 (2/2)",
            "text": "For equations express the substitutability of two expressions and, starting from a number of equations, we advance to new equations by substituting different expressions in accordance with the equations.",
            "children": [
              {
                "num": "6.2.4.1",
                "text": "Thus the proof of the proposition 2×2=4 runs as follows: [IMAGE-6241]",
                "children": []
              }
            ]
          }
        ]
      },
      {
        "num": "6.3",
        "text": "The exploration of logic means the exploration of _everything that is subject to law_. And outside logic everything is accidental.",
        "children": [
          {
            "num": "6.3.1",
            "text": "The so-called law of induction cannot possibly be a law of logic, since it is obviously a proposition with sense.—Nor, therefore, can it be an _a priori_ law.",
            "children": []
          },
          {
            "num": "6.3.2",
            "text": "The law of causality is not a law but the form of a law.",
            "children": [
              {
                "num": "6.3.2.1",
                "text": "‘Law of causality’—that is a general name. And just as in mechanics, for example, there are ‘minimum-principles’, such as the law of least action, so too in physics there are causal laws, laws of the causal form.",
                "children": [
                  {
                    "num": "6.3.2.1.1",
                    "text": "Indeed people even surmised that there must be a ‘law of least action’ before they knew exactly how it went. (Here, as always, what is certain _a priori_ proves to be something purely logical.)",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "6.3.3",
            "text": "We do not have an _a priori belief_ in a law of conservation, but rather _a priori knowledge_ of the possibility of a logical form.",
            "children": []
          },
          {
            "num": "6.3.4",
            "text": "All such propositions, including the principle of sufficient reason, the laws of continuity in nature and of least effort in nature, etc. etc.—all these are _a priori_ insights about the forms in which the propositions of science can be cast.",
            "children": [
              {
                "num": "6.3.4.1 (1/8)",
                "text": "Newtonian mechanics, for example, imposes a unified form on the description of the world. Let us imagine a white surface with irregular black spots on it."
              },
              {
                "num": "6.3.4.1 (2/8)",
                "text": "We then say that whatever kind of picture these make, I can always approximate as closely as I wish to the description of it by covering the surface with a sufficiently fine square mesh, and then saying of every square whether it is black or white."
              },
              {
                "num": "6.3.4.1 (3/8)",
                "text": "In this way I shall have imposed a unified form on the description of the surface. The form is optional, since I could have achieved the same result by using a net with a triangular or hexagonal mesh."
              },
              {
                "num": "6.3.4.1 (4/8)",
                "text": "Possibly the use of a triangular mesh would have made the description simpler: that is to say, it might be that we could describe the surface more accurately with a coarse triangular mesh than with a fine square mesh (or conversely), and so on."
              },
              {
                "num": "6.3.4.1 (5/8)",
                "text": "The different nets correspond to different systems for describing the world."
              },
              {
                "num": "6.3.4.1 (6/8)",
                "text": "Mechanics determines one form of description of the world by saying that all propositions used in the description of the world must be obtained in a given way from a given set of propositions—the axioms of mechanics."
              },
              {
                "num": "6.3.4.1 (7/8)",
                "text": "It thus supplies the bricks for building the edifice of science, and it says, ‘Any building that you want to erect, whatever it may be, must somehow be constructed with these bricks,"
              },
              {
                "num": "6.3.4.1 (8/8)",
                "text": "and with these alone.’ (Just as with the number-system we must be able to write down any number we wish, so with the system of mechanics we must be able to write down any proposition of physics that we wish.)",
                "children": []
              },
              {
                "num": "6.3.4.2 (1/5)",
                "text": "And now we can see the relative position of logic and mechanics. (The net might also consist of more than one kind of mesh: e.g."
              },
              {
                "num": "6.3.4.2 (2/5)",
                "text": "we could use both triangles and hexagons.) The possibility of describing a picture like the one mentioned above with a net of a given form tells us _nothing_ about the picture."
              },
              {
                "num": "6.3.4.2 (3/5)",
                "text": "(For that is true of all such pictures.) But what _does_ characterize the picture is that it can be described _completely_ by a particular net with a _particular_ size of mesh."
              },
              {
                "num": "6.3.4.2 (4/5)",
                "text": "Similarly the possibility of describing the world by means of Newtonian mechanics tells us nothing about the world: but what does tell us something about it is the precise _way_ in which it is possible to describe it by these means."
              },
              {
                "num": "6.3.4.2 (5/5)",
                "text": "We are also told something about the world by the fact that it can be described more simply with one system of mechanics than with another.",
                "children": []
              },
              {
                "num": "6.3.4.3",
                "text": "Mechanics is an attempt to construct according to a single plan all the _true_ propositions that we need for the description of the world.",
                "children": [
                  {
                    "num": "6.3.4.3.1",
                    "text": "The laws of physics, with all their logical apparatus, still speak, however indirectly, about the objects of the world.",
                    "children": []
                  },
                  {
                    "num": "6.3.4.3.2",
                    "text": "We ought not to forget that any description of the world by means of mechanics will be of the completely general kind. For example, it will never mention _particular_ point-masses: it will only talk about _any point-masses whatsoever_.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "6.3.5 (1/2)",
            "text": "Although the spots in our picture are geometrical figures, nevertheless geometry can obviously say nothing at all about their actual form and position. The network, however, is _purely_ geometrical; all its properties can be given _a priori_."
          },
          {
            "num": "6.3.5 (2/2)",
            "text": "Laws like the principle of sufficient reason, etc. are about the net and not about what the net describes.",
            "children": []
          },
          {
            "num": "6.3.6",
            "text": "If there were a law of causality, it might be put in the following way: There are laws of nature. But of course that cannot be said: it makes itself manifest.",
            "children": [
              {
                "num": "6.3.6.1",
                "text": "One might say, using Hertz’s terminology, that only connexions that are _subject to law_ are _thinkable_.",
                "children": [
                  {
                    "num": "6.3.6.1.1 (1/3)",
                    "text": "We cannot compare a process with ‘the passage of time’—there is no such thing—but only with another process (such as the working of a chronometer). Hence we can describe the lapse of time only by relying on some other process. Something exactly analogous applies to space: e.g."
                  },
                  {
                    "num": "6.3.6.1.1 (2/3)",
                    "text": "when people say that neither of two events (which exclude one another) can occur, because there is _nothing to cause_ the one to occur rather than the other,"
                  },
                  {
                    "num": "6.3.6.1.1 (3/3)",
                    "text": "it is really a matter of our being unable to describe _one_ of the two events unless there is some sort of asymmetry to be found. And _if_ such an asymmetry _is_ to be found, we can regard it as the _cause_ of the occurrence of the one and the non-occurrence of the other.",
                    "children": [
                      {
                        "num": "6.3.6.1.1.1 (1/3)",
                        "text": "Kant’s problem about the right hand and the left hand, which cannot be made to coincide, exists even in two dimensions. Indeed, it exists in one-dimensional space A right-hand glove could be put on the left hand, if it could be turned round in four-dimensional space."
                      },
                      {
                        "num": "6.3.6.1.1.1 (2/3)",
                        "text": "[IMAGE-636111] in which the two congruent figures, a and b, cannot be made to coincide unless they are moved out of this space. The right hand and the left hand are in fact completely congruent. It is quite irrelevant that they cannot be made to coincide."
                      },
                      {
                        "num": "6.3.6.1.1.1 (3/3)",
                        "text": "A right-hand glove could be put on the left hand, if it could be turned round in four-dimensional space.",
                        "children": []
                      }
                    ]
                  }
                ]
              },
              {
                "num": "6.3.6.2",
                "text": "What can be described can happen too: and what the law of causality is meant to exclude cannot even be described.",
                "children": []
              },
              {
                "num": "6.3.6.3",
                "text": "The procedure of induction consists in accepting as true the _simplest_ law that can be reconciled with our experiences.",
                "children": [
                  {
                    "num": "6.3.6.3.1",
                    "text": "This procedure, however, has no logical justification but only a psychological one. It is clear that there are no grounds for believing that the simplest eventuality will in fact be realized.",
                    "children": [
                      {
                        "num": "6.3.6.3.1.1",
                        "text": "It is an hypothesis that the sun will rise tomorrow: and this means that we do not _know_ whether it will rise.",
                        "children": []
                      }
                    ]
                  }
                ]
              }
            ]
          },
          {
            "num": "6.3.7",
            "text": "There is no compulsion making one thing happen because another has happened. The only necessity that exists is _logical_ necessity",
            "children": [
              {
                "num": "6.3.7.1",
                "text": "The whole modern conception of the world is founded on the illusion that the so-called laws of nature are the explanations of natural phenomena.",
                "children": []
              },
              {
                "num": "6.3.7.2 (1/2)",
                "text": "Thus people today stop at the laws of nature, treating them as something inviolable, just as God and Fate were treated in past ages."
              },
              {
                "num": "6.3.7.2 (2/2)",
                "text": "And in fact both are right and both wrong: though the view of the ancients is clearer in so far as they have a clear and acknowledged terminus, while the modern system tries to make it look as if _everything_ were explained.",
                "children": []
              },
              {
                "num": "6.3.7.3",
                "text": "The world is independent of my will.",
                "children": []
              },
              {
                "num": "6.3.7.4",
                "text": "Even if all that we wish for were to happen, still this would only be a favour granted by fate, so to speak: for there is no _logical_ connexion between the will and the world, which would guarantee it, and the supposed physical connexion itself is surely not something that we could will.",
                "children": []
              },
              {
                "num": "6.3.7.5",
                "text": "Just as the only necessity that exists is _logical_ necessity, so too the only impossibility that exists is _logical_ impossibility.",
                "children": [
                  {
                    "num": "6.3.7.5.1 (1/4)",
                    "text": "For example, the simultaneous presence of two colours at the same place in the visual field is impossible, in fact logically impossible, since it is ruled out by the logical structure of colour."
                  },
                  {
                    "num": "6.3.7.5.1 (2/4)",
                    "text": "Let us think how this contradiction appears in physics: more or less as follows—a particle cannot have two velocities at the same time; that is to say, it cannot be in two places at the same time;"
                  },
                  {
                    "num": "6.3.7.5.1 (3/4)",
                    "text": "that is to say, particles that are in different places at the same time cannot be identical. (It is clear that the logical product of two elementary propositions can neither be a tautology nor a contradiction."
                  },
                  {
                    "num": "6.3.7.5.1 (4/4)",
                    "text": "The statement that a point in the visual field has two different colours at the same time is a contradiction.)",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "num": "6.4",
        "text": "All propositions are of equal value.",
        "children": [
          {
            "num": "6.4.1 (1/3)",
            "text": "The sense of the world must lie outside the world. In the world everything is as it is, and everything happens as it does happen: _in_ it no value exists—and if it did exist, it would have no value."
          },
          {
            "num": "6.4.1 (2/3)",
            "text": "If there is any value that does have value, it must lie outside the whole sphere of what happens and is the case. For all that happens and is the case is accidental. What makes it non-accidental cannot lie _within_ the world, since if it did it would itself be accidental."
          },
          {
            "num": "6.4.1 (3/3)",
            "text": "It must lie outside the world.",
            "children": []
          },
          {
            "num": "6.4.2",
            "text": "So too it is impossible for there to be propositions of ethics. Propositions can express nothing that is higher.",
            "children": [
              {
                "num": "6.4.2.1",
                "text": "It is clear that ethics cannot be put into words. Ethics is transcendental. (Ethics and aesthetics are one and the same.)",
                "children": []
              },
              {
                "num": "6.4.2.2 (1/3)",
                "text": "When an ethical law of the form, ‘Thou shalt …’ is laid down, one’s first thought is, ‘And what if I do not do it?’ It is clear, however, that ethics has nothing to do with punishment and reward in the usual sense of the terms."
              },
              {
                "num": "6.4.2.2 (2/3)",
                "text": "So our question about the _consequences_ of an action must be unimportant.—At least those consequences should not be events. For there must be something right about the question we posed."
              },
              {
                "num": "6.4.2.2 (3/3)",
                "text": "There must indeed be some kind of ethical reward and ethical punishment, but they must reside in the action itself. (And it is also clear that the reward must be something pleasant and the punishment something unpleasant.)",
                "children": []
              },
              {
                "num": "6.4.2.3",
                "text": "It is impossible to speak about the will in so far as it is the subject of ethical attributes. And the will as a phenomenon is of interest only to psychology.",
                "children": []
              }
            ]
          },
          {
            "num": "6.4.3 (1/2)",
            "text": "If the good or bad exercise of the will does alter the world, it can alter only the limits of the world, not the facts—not what can be expressed by means of language. In short the effect must be that it becomes an altogether different world."
          },
          {
            "num": "6.4.3 (2/2)",
            "text": "It must, so to speak, wax and wane as a whole. The world of the happy man is a different one from that of the unhappy man.",
            "children": [
              {
                "num": "6.4.3.1",
                "text": "So too at death the world does not alter, but comes to an end.",
                "children": [
                  {
                    "num": "6.4.3.1.1",
                    "text": "Death is not an event in life: we do not live to experience death. If we take eternity to mean not infinite temporal duration but timelessness, then eternal life belongs to those who live in the present. Our life has no end in just the way in which our visual field has no limits.",
                    "children": []
                  },
                  {
                    "num": "6.4.3.1.2 (1/3)",
                    "text": "Not only is there no guarantee of the temporal immortality of the human soul, that is to say of its eternal survival after death; but, in any case, this assumption completely fails to accomplish the purpose for which it has always been intended."
                  },
                  {
                    "num": "6.4.3.1.2 (2/3)",
                    "text": "Or is some riddle solved by my surviving for ever? Is not this eternal life itself as much of a riddle as our present life? The solution of the riddle of life in space and time lies _outside_ space and time."
                  },
                  {
                    "num": "6.4.3.1.2 (3/3)",
                    "text": "(It is certainly not the solution of any problems of natural science that is required.)",
                    "children": []
                  }
                ]
              },
              {
                "num": "6.4.3.2",
                "text": "_How_ things are in the world is a matter of complete indifference for what is higher. God does not reveal himself _in_ the world.",
                "children": [
                  {
                    "num": "6.4.3.2.1",
                    "text": "The facts all contribute only to setting the problem, not to its solution.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "num": "6.4.4",
            "text": "It is not _how_ things are in the world that is mystical, but _that_ it exists.",
            "children": []
          },
          {
            "num": "6.4.5",
            "text": "To view the world sub specie aeterni is to view it as a whole—a limited whole. Feeling the world as a limited whole—it is this that is mystical.",
            "children": []
          }
        ]
      },
      {
        "num": "6.5",
        "text": "When the answer cannot be put into words, neither can the question be put into words. _The riddle_ does not exist. If a question can be framed at all, it is also _possible_ to answer it.",
        "children": [
          {
            "num": "6.5.1",
            "text": "Scepticism is _not_ irrefutable, but obviously nonsensical, when it tries to raise doubts where no questions can be asked. For doubt can exist only where a question exists, a question only where an answer exists, and an answer only where something _can be said_.",
            "children": []
          },
          {
            "num": "6.5.2",
            "text": "We feel that even when _all possible_ scientific questions have been answered, the problems of life remain completely untouched. Of course there are then no questions left, and this itself is the answer.",
            "children": [
              {
                "num": "6.5.2.1",
                "text": "The solution of the problem of life is seen in the vanishing of the problem. (Is not this the reason why those who have found after a long period of doubt that the sense of life became clear to them have then been unable to say what constituted that sense?)",
                "children": []
              },
              {
                "num": "6.5.2.2",
                "text": "There are, indeed, things that cannot be put into words. They _make themselves manifest_. They are what is mystical.",
                "children": []
              }
            ]
          },
          {
            "num": "6.5.3 (1/3)",
            "text": "The correct method in philosophy would really be the following: to say nothing except what can be said, i.e. propositions of natural science—i.e."
          },
          {
            "num": "6.5.3 (2/3)",
            "text": "something that has nothing to do with philosophy—and then, whenever someone else wanted to say something metaphysical, to demonstrate to him that he had failed to give a meaning to certain signs in his propositions."
          },
          {
            "num": "6.5.3 (3/3)",
            "text": "Although it would not be satisfying to the other person—he would not have the feeling that we were teaching him philosophy—_this_ method would be the only strictly correct one.",
            "children": []
          },
          {
            "num": "6.5.4 (1/2)",
            "text": "My propositions serve as elucidations in the following way: anyone who understands me eventually recognizes them as nonsensical, when he has used them—as steps—to climb up beyond them."
          },
          {
            "num": "6.5.4 (2/2)",
            "text": "(He must, so to speak, throw away the ladder after he has climbed up it.) He must transcend these propositions, and then he will see the world aright.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "num": "7",
    "text": "What we cannot speak about we must pass over in silence.",
    "children": []
  }
]
